{
  "gemini": {
    "prostate": [
      "Well-defined, thin, low-signal prostatic capsule. Homogeneous high T2 signal peripheral zone (PZ). Clear demarcation from the heterogeneous, intermediate-signal transition zone (TZ).",
      "Intact, smooth prostatic capsule. Bright, homogeneous PZ. Small, well-circumscribed TZ, consistent with minimal BPH.",
      "Sharp posterior capsule with a visible periprostatic fat plane separating it from the rectum. Zonal anatomy is preserved.",
      "Clearly defined prostatic apex, tapering inferiorly, with a distinct low-signal boundary from the external urethral sphincter.",
      "Normal zonal anatomy: High T2 signal PZ, heterogeneous intermediate-signal TZ, and low-signal central zone (CZ) are all distinguishable.",
      "Prostatic base shows a sharp, smooth interface with the bladder wall. Seminal vesicles are T2 hyperintense and distinct.",
      "Prominent, dark T2 signal of the anterior fibromuscular stroma (AFMS), providing a clear anterior boundary for the TZ.",
      "Symmetric gland. Capsule is distinct and hypointense around the entire circumference. PZ is thick and uniformly T2 hyperintense.",
      "Minor BPH: Slightly enlarged TZ with small, well-defined mixed-signal nodules, but the PZ remains thick and brightly defined.",
      "Clear differentiation between the high signal PZ and the compressed, low-signal CZ surrounding the T2-hyperintense ejaculatory ducts.",
      "Markedly enlarged TZ due to BPH, compressing the PZ into a thin, peripheral crescent. Capsule remains intact but stretched.",
      "Globular gland contour from severe BPH. The TZ is heterogeneous with multiple mixed-signal adenomatous nodules, blurring the PZ/TZ interface.",
      "BPH nodules creating an irregular, 'lumpy-bumpy' outer contour, but the overlying thin hypointense capsule is still visible.",
      "Large median lobe BPH nodule protruding superiorly into the bladder base, creating a complex, convex boundary at the bladder neck.",
      "Confluent BPH nodules obscuring normal zonal anatomy. The boundary between the heterogeneous TZ and the compressed PZ is ill-defined.",
      "Heterogeneous TZ with cystic BPH changes (focal T2 hyperintensities) and low-signal stromal nodules, creating a complex internal matrix.",
      "The enlarged TZ effaces the central zone. The peripheral zone is severely thinned, heterogeneous, and focally indistinct.",
      "Massive globular BPH (>100cc). The capsule is thinned and difficult to distinguish from adjacent low-signal structures, especially anteriorly.",
      "Irregular interface between the AFMS and the anterior aspect of the hyperplastic TZ, with nodules indenting the AFMS.",
      "BPH nodules demonstrating 'charcoal-grey' intermediate T2 signal, blending imperceptibly with the compressed PZ.",
      "Asymmetric BPH, with the left TZ lobe significantly larger, distorting the urethra and midline, and effacing the left PZ.",
      "The compressed PZ is visible only as a thin, bright rim posteriorly and laterally; it is completely effaced anteriorly by BPH.",
      "BPH causing a rounded, blunted apex, making the inferior-most boundary with the sphincter indistinct.",
      "Stromal BPH: The TZ is diffusely hypointense, mimicking malignancy, and blurring the boundary with both the AFMS and the PZ.",
      "Glandular BPH: The TZ is heterogeneous with multiple T2 bright nodules, creating complex, high-contrast internal signal boundaries.",
      "Focal, ill-defined T2 hypointense lesion in the right posterior-lateral PZ, abutting the capsule over 1.0 cm.",
      "Lenticular T2 hypointense lesion in the left PZ, causing focal bulging and irregularity of the prostatic capsule.",
      "Diffuse T2 hypointensity throughout the entire PZ, obscuring zonal boundaries and making the capsule the only visible outer border.",
      "Ill-defined low T2 signal lesion at the right apex, blurring the capsule and the interface with the external urethral sphincter.",
      "T2 hypointense lesion in the PZ with broad capsular abutment (>1.5 cm), causing retraction of the overlying capsule.",
      "Frank extraprostatic extension (EPE): T2 hypointense tumor clearly breaches the low-signal capsule into the periprostatic fat.",
      "Focal irregular bulging of the posterior capsule overlying a T2 dark lesion, with loss of the normal thin hypointense line.",
      "Obliteration of the recto-prostatic angle on the left side by a T2 hypointense tumor, indicating definite EPE.",
      "T2 hypointense lesion extending from the PZ into the TZ, effacing the normal zonal boundary between them.",
      "Tumor involvement of the neurovascular bundle: T2 hypointense signal extends postero-laterally, enveloping the bundle and obscuring the capsule.",
      "Large anterior T2 hypointense tumor, inseparable from the AFMS, obliterating the anterior gland boundary.",
      "Seminal vesicle invasion: T2 hypointense signal extends from a tumor at the base into the proximal left seminal vesicle, effacing its high-signal.",
      "Bladder neck invasion: T2 hypointense tumor at the base obliterates the fat plane and extends into the T2-dark bladder muscle.",
      "Circumscribed, round, T2 hypointense lesion in the PZ, sharply defined but with an indistinct interface with the capsule.",
      "Spiculated T2 hypointense lesion in the PZ, indicating infiltrative margins, blurring the boundary with adjacent high-signal PZ.",
      "T2 hypointense tumor effacing the low-signal capsule, making the boundary indistinct from the adjacent rectal wall.",
      "Asymmetric capsular bulging at the left base, corresponding to an underlying T2 dark lesion, suspicious for EPE.",
      "A T2 hypointense lesion 'bridges' the PZ and TZ, making zonal segmentation impossible in that sector.",
      "Diffuse low T2 signal in the PZ, mimicking prostatitis, but with focal capsular retraction and irregularity posterolaterally.",
      "Multiple, discrete T2 hypointense foci throughout the PZ, complicating the definition of 'normal' PZ signal for boundary detection.",
      "Diffuse, bilateral low T2 signal throughout the PZ, consistent with acute prostatitis, obscuring the PZ-TZ boundary.",
      "Post-biopsy hemorrhage: Multiple T2 hypointense foci (hemosiderin) scattered in the PZ, masking underlying zonal signal and lesions.",
      "Asymmetric low T2 signal in the right PZ with associated capsular thickening and periprostatic T2-bright stranding (prostatitis).",
      "The PZ is heterogeneous with mixed low and high signal, lacking a dominant signal, blurring all internal and external boundaries.",
      "Linear T2 hypointense tracts (biopsy tracks) extending from the capsule into the PZ, one of which terminates in a T2-dark hematoma.",
      "Zonal anatomy is completely effaced by diffuse inflammatory change, rendering the gland a heterogeneous, intermediate-signal ovoid.",
      "Granulomatous prostatitis: Large, ill-defined T2 hypointense mass-like area replacing most of the PZ, mimicking an infiltrative tumor.",
      "Periprostatic inflammation blurring the capsular margin, especially anteriorly, blending it with adjacent fat signal.",
      "Prostatic abscess: A T2 hyperintense, peripherally-enhancing (on T2, a complex, high-signal) collection, distorting all zones.",
      "Post-biopsy hemorrhage creating a large T2-dark region at the apex, making the apical boundary completely indistinct.",
      "Multiple small signal voids (calcifications) along the surgical capsule (PZ-TZ boundary), creating a 'dotted line' interface.",
      "Large midline utricle cyst (T2 hyperintense) at the base, splaying the ejaculatory ducts and compressing the CZ.",
      "Ejaculatory duct cyst: T2 hyperintense, tubular structure within the low-signal CZ, adjacent to a normal seminal vesicle.",
      "Müllerian duct cyst: Midline T2 bright, pear-shaped cyst extending superiorly from the base, displacing the seminal vesicles.",
      "Multiple small retention cysts (T2 bright) within the enlarged TZ, adding to its heterogeneity and complicating internal segmentation.",
      "Large calcification (signal void) at the apex, causing susceptibility artifact that obscures the capsular boundary.",
      "Ductal ectasia: T2 bright, branching, tubular structures seen within the peripheral zone, not to be confused with cysts.",
      "Verumontanum hypertrophy, visible as a low-signal mound protruding into the central T2-bright urethra within the TZ.",
      "Asymmetric seminal vesicles: Left SV is T2 hyperintense and dilated; right SV is low signal and atrophic, indicating possible obstruction.",
      "Periprostatic venous plexus is prominent and T2 bright, complicating the segmentation of the postero-lateral capsular boundary.",
      "Post-TURP defect: T2 bright, fluid-filled cavity in the central/transition zone, with an irregular, low-signal internal border.",
      "Post-radiation: Diffuse, marked T2 hypointensity of the entire gland, especially the PZ. The capsule is often thickened and indistinct.",
      "Zonal anatomy is obliterated post-radiation; the gland appears as a homogeneous low-signal structure with blurred margins.",
      "Post-HIFU: Treated area in the right PZ shows marked T2 hypointensity and volume loss, with a sharp, irregular boundary with untreated tissue.",
      "Post-brachytherapy: Multiple signal-void artifacts from seeds, obscuring large portions of the gland, especially at the periphery.",
      "Seminal vesicle agenesis (bilateral), simplifying the prostatic base segmentation boundary, which is directly adjacent to the bladder.",
      "Ectopic ureter draining into the prostate, creating a T2-bright cystic structure near the base/ejaculatory duct junction.",
      "Small, atrophic prostate (<20cc). The PZ is very thin, and zonal differentiation is poor due to low gland volume.",
      "Prostatic hypoplasia: Gland is rudimentary, T2 signal is diffusely low, and boundaries are poorly defined.",
      "Massive gland volume (>150cc) due to BPH, causing significant image artifact and an indistinct capsule at the image periphery.",
      "Ill-defined apex: The T2 signal of the apical PZ blends imperceptibly with the intermediate signal of the urethral sphincter.",
      "Obliterated recto-prostatic fat plane: The posterior capsule is directly apposed to the rectal wall, boundary is a single thin hypointense line.",
      "Anterior indistinctness: The low signal of the AFMS is confluent with low-signal stromal BPH, erasing the anterior TZ boundary.",
      "Asymmetric BPH: Left TZ nodule bulges postero-laterally, effacing the PZ and creating a 'pseudo-lesion' that abuts the capsule.",
      "Confluent T2 hypointense lesions in the PZ and TZ (bridging lesion), with EPE, and post-biopsy hemorrhage, resulting in near-total loss of normal T2 signal and boundaries."
    ]
  },
  "GPT5": {
    "prostate": [
      "Prostate gland with well-defined capsule and homogeneous intermediate T2 signal in the peripheral zone, mild hyperintensity of transition zone with smooth lobulated contour.",
      "Peripheral zone shows diffuse mild hypointensity relative to skeletal muscle with intact capsule and homogeneous transition zone signal.",
      "Prostate demonstrating asymmetric enlargement of the right transition zone with heterogeneous T2 signal intensity and compressed peripheral zone.",
      "Homogeneous hyperintense peripheral zone with discrete low-signal-intensity nodules in the transition zone consistent with benign prostatic hyperplasia.",
      "Peripheral zone exhibits focal wedge-shaped T2 hypointensity along the left posterolateral aspect, capsular margin preserved.",
      "Diffusely heterogeneous T2 signal within transition zone, irregular nodular hyperplasia causing median lobe protrusion into bladder base.",
      "Prostate gland with sharply demarcated low-signal-intensity capsule surrounding homogeneous intermediate-signal parenchyma.",
      "Asymmetric peripheral zone thinning on the right side with diffuse T2 hypointensity and preserved capsule integrity.",
      "Peripheral zone demonstrates heterogeneous high T2 signal with scattered punctate hypointense foci representing glandular atrophy.",
      "Transition zone shows multiple circumscribed round low-signal-intensity nodules with surrounding stromal hyperintensity.",
      "Well-defined prostate boundaries with mildly irregular anterior fibromuscular stroma exhibiting low T2 signal intensity.",
      "Peripheral zone hyperintense and sharply demarcated from the hypointense capsule and central gland structures.",
      "Prostate capsule intact with symmetric peripheral zone exhibiting homogeneously high T2 signal and discrete central gland demarcation.",
      "Bilateral diffuse T2 hypointensity in peripheral zones, loss of normal zonal differentiation between transition and peripheral zones.",
      "Prominent median lobe protruding into bladder base with mixed T2 signal in the transition zone and preserved peripheral signal.",
      "Peripheral zone demonstrates asymmetric low T2 signal in the left posterior aspect with focal contour bulge abutting the capsule.",
      "Transition zone enlarged with heterogeneous nodularity and intermixed areas of low and high T2 signal intensities.",
      "Prostate gland of normal volume with smooth capsule, distinct high-signal peripheral rim, and symmetric central gland morphology.",
      "Peripheral zone exhibits patchy low T2 signal intensity without contour irregularity or extracapsular extension.",
      "Diffuse stromal hyperplasia within the transition zone causing central gland enlargement and compression of peripheral tissue.",
      "Homogeneous hyperintense peripheral zone with faint linear low-signal septations corresponding to fibromuscular strands.",
      "Transition zone demonstrates encapsulated nodules with central hyperintense cores and peripheral hypointense rims.",
      "Peripheral zone hypointense on the right posterior aspect with subtle capsular bulging and obliteration of rectoprostatic fat plane.",
      "Prostate capsule continuous and smooth, internal parenchyma displaying preserved zonal anatomy and symmetric signal distribution.",
      "Heterogeneous T2 signal within the transition zone with indistinct border between transition and peripheral zones.",
      "Peripheral zone with symmetric high T2 signal, well-demarcated from low-signal-intensity fibromuscular stroma anteriorly.",
      "Prostate shows diffuse low T2 signal intensity in peripheral zone with irregular margins and loss of capsule definition posteriorly.",
      "Central gland enlarged, multinodular with mixed T2 intensity, compressing peripheral zone into thin peripheral rim.",
      "Peripheral zone high T2 signal intensity sharply confined by continuous hypointense capsule.",
      "Peripheral zone exhibits patchy hypointense foci bilaterally without distortion of capsule or adjacent structures.",
      "Transition zone mildly enlarged, discrete round nodules showing mixed stromal and glandular T2 patterns.",
      "Peripheral zone with uniform hyperintensity, smooth capsule, and clear boundary between zones.",
      "Diffuse T2 hypointensity across both zones, capsule intact, no focal bulge or extracapsular extension evident.",
      "Peripheral zone demonstrates localized asymmetric wedge-shaped low T2 signal with subtle capsular irregularity.",
      "Prostate capsule sharply hypointense, outlining gland with high contrast against surrounding periprostatic fat.",
      "Central gland enlargement due to multiple well-encapsulated nodules, each with low T2 signal rims and hyperintense centers.",
      "Peripheral zone hyperintense with focal linear hypointense striations corresponding to fibrotic septa.",
      "Prostate with compressed peripheral zone showing decreased T2 signal and mild contour distortion from central hypertrophy.",
      "Peripheral zone bilateral high T2 signal intensity, sharply bordered by hypointense capsule and central gland.",
      "Peripheral zone irregularly hypointense in the right posterolateral region, indistinct interface with capsule.",
      "Prostate capsule smooth and intact, internal zonal differentiation preserved with homogeneous transition zone.",
      "Central gland hyperplastic, mildly lobulated contour, and heterogeneous T2 signal with peripheral sparing.",
      "Peripheral zone low T2 signal intensity posteriorly with partial obliteration of rectoprostatic angle.",
      "Transition zone demonstrating dominant low-signal-intensity nodules causing asymmetric protrusion into the bladder neck.",
      "Peripheral zone homogeneous high signal intensity without nodularity or capsular irregularity.",
      "Prostate demonstrates concentric hypertrophy of transition zone, compressing hyperintense peripheral rim.",
      "Peripheral zone asymmetric hypointensity with capsular bulging, discrete from high-signal contralateral side.",
      "Transition zone large, heterogeneous, containing well-circumscribed nodules with mixed signal intensity.",
      "Peripheral zone bilaterally symmetric high T2 signal, smooth capsular contour, and visible neurovascular bundles.",
      "Prostate capsule continuous, mild anterior fibromuscular thickening with uniformly low T2 signal.",
      "Peripheral zone markedly hypointense bilaterally, indistinct zonal interface, capsule preserved.",
      "Central gland hyperintense with scattered hypointense foci, mild peripheral compression.",
      "Peripheral zone demonstrates fine reticular hypointense striations in otherwise homogeneous high T2 background.",
      "Prostate capsule thickened but intact, peripheral zone heterogeneous with diffuse mild T2 hypointensity.",
      "Transition zone moderately enlarged, with encapsulated nodules exhibiting low peripheral and high central signal.",
      "Peripheral zone posterior aspect irregularly hypointense with minimal capsular protrusion.",
      "Prostate gland of small volume, homogeneous T2 signal, and sharply delineated capsule.",
      "Peripheral zone thin symmetric high-signal rim surrounding heterogeneous central gland mass.",
      "Peripheral zone diffusely hypointense with poorly defined border against periprostatic fat.",
      "Transition zone shows coalescent low-signal nodules merging into a heterogeneous central mass.",
      "Peripheral zone high T2 signal sharply differentiated from the hypointense anterior fibromuscular stroma.",
      "Prostate capsule continuous and well delineated with uniform internal parenchymal signal.",
      "Peripheral zone shows scattered punctate hypointense foci with smooth outer capsule.",
      "Transition zone asymmetric enlargement with nodular low-signal areas compressing urethral segment.",
      "Peripheral zone demonstrates focal linear low-signal band extending from capsule toward central gland.",
      "Prostate capsule intact, mild posterior contour irregularity due to adjacent seminal vesicle impression.",
      "Peripheral zone homogeneously high signal intensity with discrete low-signal subcapsular rim.",
      "Central gland moderately enlarged, irregular internal signal but well-demarcated boundary with peripheral tissue.",
      "Peripheral zone with bilateral symmetric hyperintensity, smooth capsule, and clear stromal interface.",
      "Prostate capsule irregularly thickened, peripheral zone heterogeneous low signal intensity bilaterally.",
      "Peripheral zone patchy low T2 signal without significant contour deformation or capsular disruption.",
      "Transition zone demonstrates diffuse stromal hyperplasia producing mottled T2 appearance.",
      "Peripheral zone intact high-signal rim with compressed central gland due to median lobe hypertrophy.",
      "Prostate small with homogeneous intermediate T2 signal and continuous hypointense capsule.",
      "Peripheral zone demonstrates discrete low-signal-intensity nodule along left posterolateral margin.",
      "Transition zone large, well-encapsulated nodules with alternating high and low T2 intensities.",
      "Peripheral zone hyperintense, smooth capsule, no signs of extracapsular extension or seminal vesicle invasion.",
      "Peripheral zone bilateral mild low T2 signal without focal lesion, preserved periprostatic fat plane.",
      "Prostate capsule continuous and sharply hypointense, enclosing symmetric high-signal parenchyma.",
      "Peripheral zone right-sided asymmetric low T2 signal with subtle focal bulge and partial loss of capsule definition."
    ]
  },
  "DeepSeek": {
    "prostate": [
      "Homogeneous hyperintense peripheral zone with well-defined hypointense capsule. Transition zone demonstrates mild heterogeneous signal with few small BPH nodules.",
      "Markedly heterogeneous transition zone with numerous mixed-signal BPH nodules creating lobulated architecture. Peripheral zone maintains uniform hyperintensity.",
      "Circumferential hypointense surgical capsule clearly demarcating transition zone from peripheral zone. Peripheral zone shows diffuse T2 hypointensity suggesting prostatitis.",
      "Asymmetric transition zone enlargement with dominant hypointense BPH nodule in left anterior region. Capsular definition remains intact bilaterally.",
      "Diffuse T2 hypointensity throughout peripheral zone with maintained zonal anatomy. Capsular margin shows focal bulging posterolaterally on right.",
      "Well-defined T2 hypointense focus in left peripheral zone at apex, measuring 1.2 cm, with maintained capsular integrity.",
      "Heterogeneous transition zone with 'organized chaos' pattern of mixed BPH nodules. Anterior fibromuscular stroma appears thickened and hypointense.",
      "Global gland enlargement with preserved zonal anatomy. Peripheral zone shows patchy T2 hyperintensity with cystic changes.",
      "Focal capsular irregularity at mid-gland posteriorly with adjacent T2 hypointense lesion extending to neurovascular bundle.",
      "Central zone appears as symmetric hypointense triangular structure at gland base. Peripheral zone demonstrates uniform T2 hyperintensity.",
      "Extensive BPH changes with numerous T2 hyperintense cystic nodules within transition zone. Surgical capsule appears thickened and hypointense.",
      "Diffuse T2 hypointensity effacing normal zonal anatomy. Capsular margin remains distinct though slightly irregular.",
      "Anterior fibromuscular stroma markedly hypointense and thickened. Peripheral zone shows focal T2 hypointense area in right mid-gland.",
      "BPH-dominated transition zone with 'streamer' pattern extending toward verumontanum. Peripheral zone maintains normal T2 hyperintensity.",
      "Focal T2 hypointense lesion at right base with extracapsular extension evidenced by neurovascular bundle encasement.",
      "Uniformly hypointense peripheral zone with loss of normal architecture. Transition zone shows early BPH changes with microcystic formation.",
      "Well-demarcated T2 hyperintense cystic nodule in transition zone measuring 0.8 cm. Peripheral zone shows mild diffuse T2 hypointensity.",
      "Asymmetric transition zone enlargement with dominant anterior component. Surgical capsule appears interrupted in several locations.",
      "Diffuse T2 hypointensity throughout gland with complete effacement of zonal boundaries. Capsular definition remains intact.",
      "Peripheral zone shows wedge-shaped T2 hypointense area extending from capsule to urethra, suggesting prostatitis.",
      "Marked BPH changes with mixed solid and cystic nodules. Peripheral zone demonstrates focal T2 hypointense nodule at left apex.",
      "Circumferential capsular thickening with maintained integrity. Peripheral zone shows heterogeneous T2 signal with areas of hypointensity.",
      "Transition zone demonstrates 'cloud-like' BPH nodules with heterogeneous signal. Anterior fibromuscular stroma appears atrophic.",
      "Focal T2 hypointense lesion in anterior transition zone with capsular deformity but no definite breach.",
      "Peripheral zone shows diffuse T2 hypointensity with several discrete hypointense nodules. Capsular margin remains sharp.",
      "Central zone hypertrophy with symmetric T2 hypointense expansion at base. Peripheral zone maintains normal architecture.",
      "Extensive cystic degeneration in transition zone with multiple T2 hyperintense cysts. Surgical capsule appears thin but intact.",
      "Focal capsular retraction adjacent to T2 hypointense lesion in left peripheral zone at mid-gland level.",
      "Diffuse glandular enlargement with homogeneous T2 hypointensity throughout both peripheral and transition zones.",
      "Well-defined T2 hypointense surgical capsule separating heterogeneous transition zone from uniformly hyperintense peripheral zone.",
      "Asymmetric peripheral zone T2 hypointensity, more pronounced on right side with maintained capsular integrity.",
      "Transition zone shows 'sponge-like' architecture with numerous small T2 hyperintense cystic spaces. Peripheral zone appears normal.",
      "Focal T2 hypointense area in anterior fibromuscular stroma with overlying capsular thickening.",
      "Peripheral zone demonstrates linear T2 hypointense bands radiating from capsule toward urethra, suggesting post-inflammatory changes.",
      "Marked transition zone enlargement with predominantly solid hypointense BPH nodules. Capsular definition remains sharp.",
      "Diffuse T2 hypointensity in peripheral zone with focal areas of signal void suggesting calcifications.",
      "Central zone appears prominent and hypointense, blending with transition zone. Peripheral zone shows patchy T2 hyperintensity.",
      "Focal capsular bulge with adjacent T2 hypointense mass in right peripheral zone at base level.",
      "Heterogeneous transition zone with 'swiss cheese' pattern of cystic and solid BPH nodules. Surgical capsule appears well-defined.",
      "Peripheral zone shows multifocal T2 hypointense lesions with maintained capsular integrity and zonal anatomy.",
      "Global gland enlargement with predominant transition zone hypertrophy. Peripheral zone compressed but maintains T2 hyperintensity.",
      "Focal T2 hypointense lesion at verumontanum level with extension into both peripheral and transition zones.",
      "Diffuse capsular thickening with maintained integrity. Peripheral zone shows homogeneous T2 hypointensity throughout.",
      "Transition zone demonstrates predominantly T2 hyperintense cystic BPH changes. Peripheral zone appears unremarkable.",
      "Asymmetric peripheral zone T2 hypointensity with focal capsular irregularity on left side at mid-gland.",
      "Central zone appears atrophic with maintained hypointensity. Peripheral zone shows diffuse T2 hypointensity with focal hyperintense areas.",
      "Marked BPH changes with 'grape cluster' pattern of nodules in transition zone. Surgical capsule appears thickened.",
      "Focal T2 hypointense lesion in anterior transition zone with capsular abutment but no definite invasion.",
      "Peripheral zone shows diffuse T2 hypointensity with loss of normal architecture but maintained capsular definition.",
      "Transition zone enlargement with mixed solid and cystic components. Peripheral zone demonstrates focal T2 hypointense area at right base.",
      "Circumferential capsular hypointensity with focal interruption posteriorly adjacent to T2 hypointense lesion.",
      "Diffuse glandular T2 hypointensity with complete loss of zonal differentiation. Capsular margin remains distinct.",
      "Peripheral zone shows multifocal T2 hypointense nodules with intervening areas of normal T2 hyperintensity.",
      "Transition zone demonstrates 'honeycomb' pattern of BPH nodules with heterogeneous signal. Surgical capsule appears thin.",
      "Focal T2 hypointense lesion in left peripheral zone with capsular retraction and neurovascular bundle involvement.",
      "Asymmetric transition zone enlargement with dominant hypointense nodule on right side. Peripheral zone appears normal.",
      "Diffuse peripheral zone T2 hypointensity with focal areas of capsular thickening but no definite breach.",
      "Central zone appears prominent and hypointense, merging with transition zone. Peripheral zone shows uniform T2 hyperintensity.",
      "Marked BPH changes with predominantly solid hypointense nodules. Peripheral zone compressed but maintains normal signal.",
      "Focal T2 hypointense area in anterior fibromuscular stroma with overlying capsular preservation.",
      "Peripheral zone shows linear T2 hypointense strands suggesting post-inflammatory changes. Capsular margin remains sharp.",
      "Transition zone enlargement with 'mixed bag' pattern of BPH nodules. Surgical capsule appears well-defined and hypointense.",
      "Focal capsular irregularity adjacent to T2 hypointense lesion in right peripheral zone at apex level.",
      "Diffuse glandular T2 hypointensity with maintained zonal anatomy. Capsular definition remains intact throughout.",
      "Peripheral zone demonstrates wedge-shaped T2 hypointense area with base at capsule, suggesting prostatitis.",
      "Transition zone shows predominantly cystic BPH changes with T2 hyperintense nodules. Peripheral zone appears unremarkable.",
      "Asymmetric peripheral zone T2 hypointensity with focal capsular thickening on left side at mid-gland.",
      "Central zone hypertrophy with symmetric T2 hypointense expansion. Peripheral zone shows patchy T2 hypointensity.",
      "Marked BPH changes with 'organized chaos' pattern in transition zone. Surgical capsule appears interrupted in several areas.",
      "Focal T2 hypointense lesion in anterior transition zone with capsular deformity but maintained integrity.",
      "Peripheral zone shows diffuse T2 hypointensity with complete loss of normal architecture. Capsular margin remains sharp.",
      "Transition zone enlargement with mixed signal BPH nodules. Peripheral zone demonstrates focal T2 hypointense area at left base.",
      "Circumferential capsular hypointensity with focal bulge anteriorly adjacent to T2 hypointense lesion.",
      "Diffuse glandular T2 hypointensity with effacement of zonal boundaries. Capsular definition remains intact.",
      "Peripheral zone shows multifocal T2 hypointense nodules with maintained capsular integrity and zonal anatomy.",
      "Transition zone demonstrates 'sponge-like' architecture with numerous small T2 hyperintense cysts. Surgical capsule appears thickened.",
      "Focal T2 hypointense lesion in left peripheral zone with capsular retraction and adjacent neurovascular bundle thickening.",
      "Asymmetric transition zone enlargement with dominant anterior component. Peripheral zone shows diffuse T2 hypointensity.",
      "Diffuse peripheral zone T2 hypointensity with focal areas of signal void suggesting calcifications. Capsular margin remains sharp.",
      "Central zone appears prominent and hypointense, blending with transition zone. Peripheral zone shows uniform T2 hyperintensity."
    ]
  }
}