{
    "gemini": {
        "prostate": [
    "Uniformly high T2 signal intensity throughout the peripheral zone.",
    "Diffuse, mild T2 hypointensity in the peripheral zone, consistent with prostatitis.",
    "Linear, wedge-shaped T2 hypointensity in the peripheral zone, likely post-inflammatory scar.",
    "Geographic, ill-defined T2 low signal in the posterior peripheral zone.",
    "Bilateral, symmetric T2 hypointensity in the peripheral zone.",
    "Peripheral zone demonstrating normal 'charcoal' high T2 signal.",
    "Focal, T2 hyperintense signal in the peripheral zone, consistent with acute hemorrhage.",
    "Markedly T2 hypointense signal in the peripheral zone, consistent with chronic hemorrhage/hemosiderin.",
    "Peripheral zone compressed and thinned by an enlarged transition zone.",
    "Punctate T2 hypointense foci within the peripheral zone.",
    "Focal, circumscribed, homogeneous, moderately hypointense lesion in the peripheral zone.",
    "Non-circumscribed, ill-defined, T2 hypointense lesion in the peripheral zone.",
    "Lenticular, moderately hypointense mass in the peripheral zone.",
    "Peripheral zone lesion demonstrating 'erased charcoal sign' or smudged appearance.",
    "Markedly T2 hypointense, focal nodule in the peripheral zone at the apex.",
    "Spiculated, T2 hypointense mass in the peripheral zone with indistinct margins.",
    "Irregularly shaped, homogeneous low T2 signal lesion in the peripheral zone.",
    "Lobulated, T2 hypointense mass at the peripheral zone-central zone interface.",
    "Peripheral zone lesion with T2 signal isointense to muscle.",
    "Broad-based T2 hypointense lesion abutting the prostatic capsule.",
    "Peripheral zone lesion demonstrating clear breach of the prostatic capsule.",
    "T2 hypointense mass in the peripheral zone with extracapsular extension.",
    "Peripheral zone lesion with invasion of the adjacent neurovascular bundle.",
    "T2 hypointense tumor signal obliterating the rectoprostatic angle.",
    "Peripheral zone lesion at the base with direct seminal vesicle invasion.",
    "Asymmetric bulging of the prostatic capsule overlying a T2 hypointense peripheral zone lesion.",
    "T2 hypointense lesion with tumor-capsule interface greater than 1.5 cm.",
    "Ill-defined T2 hypointense signal in the peripheral zone, obscured by hemorrhage.",
    "Small, round, T2 hypointense focus in the peripheral zone, less than 1.5 cm.",
    "Large, invasive, T2 hypointense mass replacing the entire peripheral zone.",
    "Diffuse T2 hypointensity in the peripheral zone, suspicious for diffuse infiltrative tumor.",
    "Enlarged transition zone with heterogeneous signal intensity.",
    "Transition zone demonstrating 'organized chaos' appearance of mixed signal nodules.",
    "Multiple, well-circumscribed, encapsulated nodules in the transition zone (BPH).",
    "Transition zone BPH nodule with high T2 signal (glandular hypertrophy).",
    "Transition zone BPH nodule with low T2 signal (stromal hypertrophy).",
    "Circumscribed, stromal BPH nodule with T2 hypointense signal, mimicking cancer.",
    "Heterogeneous BPH nodule with a T2 hypointense rim or 'pseudo-capsule'.",
    "BPH nodule with internal T2 hyperintense cystic degeneration.",
    "Symmetrical, globular enlargement of the transition zone.",
    "Transition zone demonstrating multiple, small, T2 bright 'leave-like' changes.",
    "Pedunculated, intravesical protrusion of a heterogeneous transition zone nodule.",
    "Median lobe hypertrophy with heterogeneous T2 signal.",
    "Large, circumscribed, heterogeneous mass in the transition zone causing bladder outlet obstruction.",
    "Ill-defined, homogeneous, moderately hypointense lesion in the transition zone.",
    "Lenticular, T2 hypointense, non-circumscribed lesion in the anterior transition zone.",
    "Homogeneous, 'charcoal black', T2 hypointense lesion in the transition zone.",
    "Transition zone lesion demonstrating the 'erased charcoal sign'.",
    "Non-circumscribed, 'water-drop-shaped', T2 hypointense lesion in the transition zone.",
    "Ill-defined, T2 hypointense lesion in the transition zone with obscured margins.",
    "T2 hypointense lesion in the anterior horn of the transition zone.",
    "Transition zone mass with indistinct margins, invading the anterior fibromuscular stroma.",
    "Transition zone lesion with invasion of the urethral sphincter.",
    "Anterior, non-circumscribed, T2 hypointense mass effacing the transition zone architecture.",
    "Irregular, T2 hypointense mass disrupting the 'organized chaos' of the transition zone.",
    "Central zone demonstrating symmetric, low T2 signal.",
    "Normal inverted 'M' or 'mustache' appearance of the T2 hypointense central zone.",
    "Central zone compressed and displaced by a transition zone BPH nodule.",
    "Ill-defined T2 hypointense signal replacing the normal central zone architecture.",
    "T2 hypointense lesion at the prostate base infiltrating the central zone.",
    "Ejaculatory ducts appearing as T2 hyperintense linear structures within the central zone.",
    "Dilated and T2 hyperintense ejaculatory ducts, consistent with obstruction.",
    "Anterior fibromuscular stroma (AFMS) appearing as a symmetric, T2 hypointense band.",
    "Asymmetric, focal, T2 hypointense thickening of the anterior fibromuscular stroma.",
    "Nodular, T2 hypointense mass arising from the anterior fibromuscular stroma.",
    "Invasion of the T2 hypointense anterior fibromuscular stroma by an adjacent transition zone tumor.",
    "Homogeneous, T2 hypointense appearance of the entire prostate gland (post-radiation).",
    "Loss of the normal T2 hyperintense signal of the peripheral zone (atrophy).",
    "Preserved, thin, T2 hypointense line of the prostatic capsule.",
    "Focal disruption or breach of the T2 hypointense prostatic capsule.",
    "Irregular, spiculated outer contour of the prostatic capsule.",
    "Diffuse periprostatic T2 hyperintense stranding, consistent with inflammation.",
    "Normal, T2 hyperintense, 'bunch of grapes' appearance of the seminal vesicles.",
    "Low T2 signal intensity replacing the normal high T2 signal within a seminal vesicle.",
    "Asymmetric, low T2 signal and distension of one seminal vesicle.",
    "Markedly T2 hyperintense, thin-walled, round lesion (prostatic cyst).",
    "Midline, T2 hyperintense cyst near the verumontanum (utricle cyst).",
    "Thick-walled, T2 hyperintense collection with surrounding inflammation (prostatic abscess).",
    "T2 hypointense tumor signal extending into the bladder neck.",
    "Effacement of the normal T2 hypointense signal of the external urethral sphincter.",
    "Diffuse, heterogeneous T2 signal throughout the entire gland with volume loss (post-radiation changes)."
  ],
        "style": [
            "High signal-to-noise ratio (SNR) and high spatial resolution, providing sharp delineation of the hypointense prostatic capsule against hyperintense periprostatic fat.",
            "Low SNR, resulting in a grainy or noisy texture throughout the gland, particularly obscuring the PZ-TZ boundary.",
            "Severe motion artifacts in the phase-encoding direction, appearing as ghosting, which blurs the anterior prostatic margin and the AFMS.",
            "Marked susceptibility artifact from rectal gas, causing signal void and geometric distortion of the posterior peripheral zone and capsule.",
            "Endorectal coil acquisition: Characterized by extremely high SNR in the posterior gland (PZ) with significant signal intensity fall-off anteriorly towards the AFMS.",
            "Poor or failed fat saturation, resulting in high signal from periprostatic fat, which reduces the contrast and conspicuity of the capsular boundary.",
            "Low contrast-to-noise ratio (CNR) between the peripheral zone and transition zone, rendering zonal anatomy indistinct.",
            "Prominent chemical shift artifact at the prostate-fat interface, seen as a dark pixel band on one side and a bright band on the opposite side.",
            "Heavily T2-weighted sequence (long TE): Fluid in the bladder and seminal vesicles is exceptionally bright, enhancing contrast but increasing motion sensitivity.",
            "Visible aliasing (wrap-around) artifact, where structures from outside the FOV (e.g., pelvic sidewalls) are superimposed laterally.",
            "Typical 1.5T image quality: Moderate SNR, slightly less distinct zonal differentiation, and less pronounced susceptibility artifacts compared to 3T.",
            "Significant bias field artifact (intensity inhomogeneity), causing signal shading across the image, with one side of the prostate appearing darker than the other.",
            "Partial volume averaging due to thick slices (e.g., 5-6mm), resulting in blurred and indistinct margins at the prostatic apex and base.",
            "High spatial resolution (small voxels) but low SNR, creating a sharp yet noisy image where fine textures are obscured by grain.",
            "Non-uniform fat suppression, failing over the anterior abdominal wall and pubic bone marrow, leading to regional high signal artifacts.",
            "Pelvic phased-array coil acquisition: Good, uniform signal intensity and SNR across the entire prostate and surrounding pelvic structures.",
            "Signal void artifacts from metallic surgical clips (e.g., post-TURP or lymphadenectomy) obscuring the prostatic base and bladder neck.",
            "Peristaltic motion from the rectum causing blurring and distortion of the posterior capsule and neurovascular bundles.",
            "High-contrast 3T image: Hyperintense PZ, heterogeneous intermediate-signal TZ, and a clearly defined hypointense capsule.",
            "Washed-out appearance with low overall contrast, likely due to improper window/level settings or insufficient T2 weighting (short TE).",
            "Multiple punctate signal voids within the TZ and at the PZ-TZ interface, consistent with calcifications causing susceptibility artifacts.",
            "Pixelated appearance, indicative of a low-resolution acquisition matrix or excessive digital zoom.",
            "Complete failure of fat saturation: Periprostatic fat, subcutaneous fat, and bone marrow are all hyperintense, masking capsular margins.",
            "Image acquired with a mispositioned or partially inflated endorectal coil, leading to asymmetric signal intensity and distortion.",
            "Image plane is obliquely angulated, not a true axial, coronal, or sagittal view, complicating volumetric assessment.",
            "Severe B1 field inhomogeneity (dielectric effect) at 3T, causing a central signal drop-out within the transition zone.",
            "Motion artifact from bladder pulsatility creating phase ghosts superior to the prostate, overlapping the seminal vesicles.",
            "Minimally T2-weighted: Fluid signal is only moderately bright, and tissue contrast (PZ/TZ) is notably poor.",
            "Pronounced signal loss (T2 shortening) in the posterior PZ due to hemosiderin from recent biopsy, mimicking a tumor.",
            "Image corrupted by a linear 'zipper' artifact (k-space spike) running horizontally through the gland.",
            "Field of View (FOV) is too small (truncated), cutting off the lateral margins of the periprostatic fat and seminal vesicles.",
            "Field of View (FOV) is excessively large, leading to small prostate size on the image and reduced effective spatial resolution.",
            "High-quality 3T study: Uniform signal, excellent fat suppression, and crisp zonal boundaries, ideal for segmentation.",
            "Grainy, low-signal image, likely a 1.5T acquisition with insufficient signal averages (NEX/NSA) or a large patient.",
            "Prominent pulsatility artifacts from the iliac arteries, causing ghost replicas of the vessels across the image.",
            "Incomplete saturation of the periprostatic venous plexus, which appears bright and can be mistaken for or obscure EPE.",
            "Massive susceptibility artifact from a total hip prosthesis, creating a large signal void and severe distortion that obliterates the entire ipsilateral gland.",
            "Non-uniform signal intensity within the peripheral zone itself, likely a 'coil sensitivity' variation rather than true pathology.",
            "Over-smoothed image due to post-processing (e.g., noise reduction filter), resulting in a 'waxy' appearance and loss of fine texture.",
            "Image demonstrates a good trade-off between scan time and quality: minor graininess is present, but all critical boundaries are defined.",
            "Blooming susceptibility artifacts from numerous brachytherapy seeds, appearing as signal voids larger than the seeds themselves.",
            "Failed water suppression (e.g., in a fat-only sequence), resulting in an inverted-contrast appearance.",
            "Respiratory motion artifact causing blurring and indistinctness of the prostatic base and bladder neck interface.",
            "Severe aliasing from a small FOV in the phase-encode direction, wrapping the posterior buttocks anteriorly over the prostate.",
            "Image has a 'flat' dynamic range, with all tissues compressed into a narrow range of intermediate gray signals.",
            "High-resolution coronal T2: Sharp, high-contrast delineation of the prostatic apex and its interface with the hypointense external urethral sphincter.",
            "High-resolution sagittal T2: Clear visualization of the AFMS, bladder neck, and the retroprostatic fat plane.",
            "Image globally blurred due to gross patient movement during the acquisition, rendering all structures indistinct.",
            "Visible Gibbs (truncation) ringing artifacts, appearing as fine parallel lines near high-contrast edges like the bladder wall or capsule.",
            "Minimal artifacts, uniform signal, and excellent PZ-TZ contrast; a high-diagnostic-quality study.",
            "Diffuse signal hypointensity across the entire gland, characteristic of post-radiation fibrosis, reducing all internal contrast.",
            "Image quality compromised by severe ascites, which introduces motion, signal inhomogeneity, and dielectric effects.",
            "Moderate T2 weighting (TE ~80-100ms), providing a good balance between high SNR and sufficient T2 contrast.",
            "Image acquired using parallel imaging (e.g., SENSE, GRAPPA) with a high acceleration factor, leading to central SNR drop-off or noise enhancement.",
            "Geometric distortion (warping) at the peripheries of the field of view, causing the prostate to appear slightly ovoid or misshapen.",
            "Noisy' fat suppression: The signal from fat is not nulled to black but remains as a grainy, intermediate-gray signal.",
            "Excellent flow compensation, rendering blood vessels (venous plexus, iliacs) as dark, signal-void structures.",
            "Incomplete flow suppression, with hyperintense signal in pelvic vessels leading to pulsatility ghosting artifacts.",
            "High-resolution 3D T2 acquisition (e.g., CUBE, SPACE): Isotropic voxels provide sharp multiplanar reformats, but with slightly lower SNR than 2D.",
            "3D T2 acquisition with motion artifact, resulting in a 'stair-step' artifact on sagittal and coronal reformats.",
            "Image from an air-filled endorectal coil, causing a large susceptibility artifact and signal void at the posterior gland boundary.",
            "Low-field (e.g., 0.5T or 1.0T) acquisition: Characterized by fundamentally low SNR, poor resolution, and long scan times.",
            "Poor shimming, resulting in non-uniform signal and failed, patchy fat saturation across the field of view.",
            "Signal-void artifacts from metallic sutures in the post-prostatectomy bed, obscuring assessment of the anastomosis.",
            "Chemical shift artifact (Type 2) causing blurring and signal loss at zonal boundaries due to intravoxel dephasing.",
            "High-bandwidth acquisition: Minimizes chemical shift and susceptibility artifacts but at the cost of reduced SNR.",
            "Low-bandwidth acquisition: Maximizes SNR and contrast but is highly sensitive to motion, chemical shift, and susceptibility artifacts.",
            "Image windowed too brightly (high window center/width), saturating the high-signal PZ and seminal vesicles, obscuring internal detail.",
            "Image windowed too darkly (low window center/width), making the hypointense capsule and AFMS indistinguishable from signal void.",
            "Strong dielectric shading at 3T in a large patient, causing a 'dark' band across the center of the abdomen, affecting the prostate.",
            "T2-weighted turbo spin-echo (TSE) sequence with a long echo train length, causing perceptible blurring of edges and T2 decay effects.",
            "Single-shot fast spin-echo (ssFSE) acquisition: Inherently low resolution and blurred, 'smeared' appearance, but very fast and motion-robust.",
            "Image quality degraded by an improperly placed anterior surface coil, leading to poor signal in the anterior gland.",
            "Posterior signal drop-off in a 1.5T exam using only an anterior phased-array coil, compromising PZ visualization.",
            "Cross-talk artifact: Faint lines visible at the intersection of slice groups in an interleaved acquisition.",
            "Data clipping artifact: Regions of extremely high signal (e.g., urine) appear 'flat' white with a surrounding dark halo.",
            "Scan acquired with anti-peristaltic agent (e.g., Glucagon): Rectal wall is sharp and motion-free, improving posterior margin assessment.",
            "Scan acquired without anti-peristaltic agent: Significant blurring and ghosting from the rectum, obscuring the posterior capsule.",
            "High-resolution, small FOV 'zoom' scan of the prostate: Excellent detail but potential for aliasing if outer suppression bands fail.",
            "Vibration artifact (e.g., from gradient knocking or cooling system), causing fine, 'wavy' lines or 'herringbone' patterns across the image."
        ]
    },
    "GPT5": {
        "prostate": [
"Peripheral-zone focal, lenticular, markedly hypointense lesion at the left mid-gland with spiculated interface to the capsule and subtle bulge.",
"Right apical peripheral-zone oval T2-dark focus with indistinct margins and obliteration of the adjacent rectoprostatic angle.",
"Diffuse, wedge-shaped hypointensity in the posterior peripheral zone at the base consistent with inflammatory change.",
"Transition-zone ill-defined, lenticular 'erased charcoal' low-T2 mass displacing the urethra anteriorly.",
"Encapsulated transition-zone nodule with heterogeneous central T2 hyperintensity and thin low-signal capsule, compatible with glandular BPH.",
"Homogeneously low-T2 stromal BPH nodule in the anterior transition zone with smooth capsule and round morphology.",
"Band-like low-T2 thickening in the anterior fibromuscular stroma causing anterior contour bulge without discrete capsule breach.",
"Long-segment tumor–capsule contact over 18 mm along the left posterolateral mid-gland with capsule irregularity.",
"Asymmetric thickening and low-T2 signal of the left neurovascular bundle adjacent to a peripheral-zone lesion.",
"Posterior capsular bulge with blurring of the capsule and intermediate-to-low T2 signal extending into periprostatic fat.",
"Loss of the normal thin high-T2 rim of the peripheral zone with patchy low-signal replacement throughout the base.",
"Focal low-T2 nodule at the right apical posterolateral gland abutting the urethra with teardrop configuration.",
"Multifocal punctate T2 signal voids along the ejaculatory ducts consistent with calcifications.",
"Post-biopsy linear T2-hypointense tracts radiating from the posterior capsule into the peripheral zone.",
"Serpiginous low-T2 foci in the peripheral zone at the mid-gland suggesting intraparenchymal hemorrhage.",
"Diffuse low-T2 signal throughout the gland with volume loss and indistinct zonal anatomy following radiation therapy.",
"Geographic sharply marginated T2-dark ablation zone in the right gland compatible with post-HIFU change.",
"Post-cryotherapy confluent low-T2 scarring anteriorly with mild anterior capsular retraction.",
"Central TURP cavity as a high-T2 fluid-filled defect with a thin low-signal rim and communication with the prostatic urethra.",
"Median lobe hypertrophy protruding into the bladder base showing mixed heterogeneous T2 signal with internal cystic foci.",
"Symmetric, triangular low-T2 central zone prominence at the base with preserved margins and no mass effect.",
"Left seminal vesicle replaced by low-T2 tissue contiguous with a peripheral-zone mass indicating vesicle invasion.",
"Asymmetric loss of the normal high-T2 architecture of the right seminal vesicle with irregular low-signal stranding.",
"Midline Müllerian duct cyst superior to the verumontanum with homogeneous high T2 signal and thin wall.",
"Paramedian ejaculatory-duct cyst near the base with bright T2 fluid signal and mild ductal dilatation.",
"Anterior transition-zone lesion with heterogeneous predominantly low-T2 signal and ill-defined margins compressing the urethra.",
"Peripheral-zone linear wedge of low T2 at the right base with fuzzy edges and no capsular distortion, favoring prostatitis.",
"Large confluent low-T2 mass occupying the left posterior gland with overt capsular bulge and broad contact.",
"Obliteration of the rectoprostatic angle with low-T2 tissue tracking toward the levator ani on the left.",
"Nodular low-T2 focus at the apex breaching the capsule with subtle spiculation into periprostatic fat.",
"Cystic BPH nodule in the transition zone showing central high-T2 fluid with peripheral thin low-signal capsule.",
"Heterogeneous transition-zone 'organized chaos' with multiple circumscribed nodules and preserved pseudocapsule without dominant low-T2 mass.",
"Diffuse peripheral-zone atrophy with thinning and patchy low T2 replacing the usual bright signal bilaterally.",
"Anterior horn low-T2 band contiguous with the anterior fibromuscular stroma producing mild anterior contour bossing.",
"Right-sided peripheral-zone lesion encasing but not obliterating the neurovascular bundle with low T2 and irregular margin.",
"Focal T2 hyperintense mass in the peripheral zone with thin low-signal rim suggestive of mucinous adenocarcinoma phenotype.",
"Small round low-T2 focus at the left apex with a smooth margin and no capsular contact exceeding 5 mm.",
"Bilateral seminal vesicle dilatation with homogeneous high-T2 fluid and thin septations suggesting obstructive etiology.",
"Periurethral low-T2 plaque-like thickening at the mid-gland with subtle urethral narrowing.",
"Right base peripheral-zone low-T2 lesion with satellite nodules and bridging low-signal bands.",
"Isolated low-T2 nodule in the central zone at the verumontanum with lobulated border and posterior displacement of the urethra.",
"Irregular low-T2 tissue extending across the midline at the base through the posterior commissure.",
"Left anterior transition-zone mass with homogeneous low T2 and indistinct boundary merging into stromal hyperplasia.",
"Peripheral-zone low-T2 lesion with internal fine linear high-T2 striations suggesting preserved ducts.",
"Encapsulated, ovoid high-T2 cyst in the peripheral zone with a dependent low-signal layer indicating proteinaceous debris.",
"Clustered punctate signal voids casting minor susceptibility artifacts consistent with brachytherapy seeds.",
"Posterolateral capsular irregularity with contour step-off adjacent to a low-T2 plaque-like tumor.",
"Diffuse low-T2 signal in the peripheral zone with asymmetric left greater than right involvement and spared central gland.",
"Transition-zone nodule with central low-T2 core and peripheral mixed signal, partly encapsulated and compressing adjacent nodules.",
"Apex lesion with low T2 causing distortion of the urethral sphincter complex and asymmetry of the urethral lumen.",
"Peripheral-zone ribbon-like low-T2 stranding following the course of periprostatic veins without mass effect.",
"Anterior mid-gland low-T2 mass indenting the prostate contour and effacing the anterior fat plane.",
"Posterior base low-T2 lesion with extension into the seminal vesicle base via the ejaculatory duct orifice.",
"Right apical lesion with low T2 and a broad-based contact along the capsule exceeding 15 mm without frank breach.",
"Central gland 'erased charcoal' area crossing the midline with lenticular shape and lack of circumscribed capsule.",
"Patchy low-T2 fibrosis along the posterior capsule with smooth contour and no associated mass effect.",
"Peripheral-zone low-T2 nodule adjacent to a focus of T2-bright post-biopsy edema.",
"Left posteromedial base lesion causing tethering of Denonvilliers' fascia and posterior contour irregularity.",
"Anterior fibromuscular stromal hypertrophy as a thick uniform low-T2 band with sharp interface to the transition zone.",
"Peripheral-zone confluent low-T2 mass at the base with invasion of the prostatic urethra producing intraluminal irregularity.",
"Apex peripheral-zone lesion with low T2 and angular margins pointing toward the capsule, creating a stellate outline.",
"Nodular low-T2 thickening surrounding the ejaculatory ducts with mild ductal narrowing and symmetric appearance.",
"Left lateral mid-gland low-T2 plaque with curved outer margin paralleling the capsule and fine spicules.",
"Base lesion with low T2 and internal round high-T2 cystic spaces creating a cribriform pattern.",
"Diffuse stromal-predominant BPH pattern with multiple homogeneously low-T2 nodules compressing the peripheral zone.",
"Peripheral-zone low-T2 focus with adjacent periprostatic fat stranding and tiny capsular discontinuity.",
"Right transition-zone mass with low T2 and anterolateral capsular bulge displacing the levator ani.",
"Post-radiation contracted gland with effaced zonal anatomy and uniformly low T2, plus telangiectatic high-T2 urethral halo.",
"Peripheral-zone patchy low T2 surrounding a T2-bright abscess cavity with thin low-signal rim and internal septations.",
"Midline utricle cyst with high T2 and eccentric low-signal mural nodule along its posterior wall.",
"Apical posterolateral low-T2 lesion with truncation of the normal hyperintense peripheral-band sign.",
"Anterior transition-zone low-T2 nodule invading the anterior fibromuscular stroma with indistinct boundary.",
"Peripheral-zone low-T2 lesion showing crescentic subcapsular location with overlying capsule puckering.",
"Right base low-T2 mass crossing the midline with bridging strands through the posterior commissure.",
"Peripheral-zone low-T2 focus with internal tiny T2-bright acini creating a salted-and-pepper appearance.",
"Capsular bulge at the left mid-gland with external convexity and dark capsular interruption adjacent to a low-T2 mass.",
"Transition-zone lesion with trail-sign extension toward the urethra and asymmetric indentation of the lumen.",
"Peripheral-zone diffuse low-T2 band paralleling the capsule with smooth margins and no focal nodularity.",
"Irregular, multilobulated low-T2 mass at the base with contiguous low-signal replacing the normal seminal vesicle folds.",
"Anterior apex low-T2 lesion with subtle tenting of the anterior capsule and minimal mass effect on the puboprostatic ligaments."
],
        "style": [
            "High signal-to-noise ratio T2-weighted image with uniform fat suppression and minimal motion artifacts, showing excellent delineation of the prostate capsule.",
            "T2-weighted axial acquisition with mild Gibbs ringing along the capsule margin, moderate SNR, and preserved zonal contrast.",
            "T2-weighted image with subtle susceptibility artifacts from rectal gas, slightly reducing posterior peripheral zone visibility.",
            "T2-weighted image demonstrating mild phase-encoding ghosting due to patient motion, otherwise good contrast between zones.",
            "Low signal-to-noise T2-weighted image with granular noise texture and reduced delineation of transition zone nodularity.",
            "High-resolution T2-weighted image with thin slices and high SNR, clearly distinguishing the hypointense capsule and hyperintense peripheral zone.",
            "Moderate SNR image with slight blurring secondary to incomplete fat suppression, peripheral zone contrast partially reduced.",
            "Axial T2-weighted sequence with mild wrap-around artifact along the anterior rectal wall, gland margins still discernible.",
            "T2-weighted image acquired with turbo spin echo technique, high SNR, minor blurring from long echo train length.",
            "Low SNR image with coarse background noise and faint ghosting in phase-encoding direction, diminished capsular definition.",
            "High-contrast T2-weighted image with excellent spatial resolution and uniform signal across prostate parenchyma.",
            "Image demonstrates mild chemical shift artifact along the prostate–periprostatic fat interface, minimal diagnostic interference.",
            "T2-weighted image with slightly uneven B1 field causing regional signal inhomogeneity in the peripheral zone.",
            "T2-weighted fast spin-echo image with moderate motion artifact from respiration, peripheral rim blurred.",
            "Image characterized by excellent SNR, sharp capsular boundary, and minimal motion-induced distortion.",
            "T2-weighted image with low contrast-to-noise ratio between peripheral and transition zones due to insufficient TE optimization.",
            "Axial T2-weighted image demonstrating magnetic susceptibility distortion near air-tissue interface posteriorly.",
            "High SNR image with strong peripheral-to-transition zone contrast, minor Gibbs ringing along gland boundaries.",
            "T2-weighted image with motion-induced phase ghosts anterior to the prostate, mild reduction in clarity.",
            "Moderate noise image with adequate spatial resolution and visible partial volume effects at the apex.",
            "High-quality T2-weighted image with uniform signal, sharp delineation of capsule, and excellent zonal contrast.",
            "T2-weighted image showing nonuniform coil sensitivity, causing mild anterior signal drop-off.",
            "Low SNR image with salt-and-pepper noise texture, loss of fine detail in peripheral gland structures.",
            "High spatial resolution T2-weighted acquisition with slight aliasing artifact along anterior pelvic wall.",
            "T2-weighted image with visible pulsation artifact from iliac vessels encroaching on peripheral zone signal.",
            "Moderate-resolution image with adequate SNR but partial volume averaging at prostate–seminal vesicle junction.",
            "T2-weighted image showing excellent gray-scale dynamic range with subtle hypointense fibromuscular stroma differentiation.",
            "Image acquired with endorectal coil providing superior SNR and detailed capsular definition but minor field inhomogeneity.",
            "Low-SNR image with distinct granular noise pattern and poor zonal differentiation between central and peripheral regions.",
            "High-contrast image with slight distortion due to magnetic field nonuniformity near posterior capsule.",
            "Moderate SNR image showing ghosting artifact secondary to rectal peristalsis, gland margins partially obscured.",
            "T2-weighted fast spin echo image with high SNR, slight blurring from long echo spacing, and smooth signal transition.",
            "Low SNR acquisition exhibiting random noise spikes and reduced visibility of anterior fibromuscular stroma.",
            "Image with mild B0 inhomogeneity across the field-of-view, creating anterior-to-posterior signal gradient.",
            "High-quality T2-weighted image with minimal susceptibility distortion and excellent zonal demarcation.",
            "Moderate-resolution image with clear edge enhancement from mild Gibbs phenomenon around the prostate capsule.",
            "T2-weighted image displaying uniform signal distribution, minimal phase wrap, and consistent brightness across zones.",
            "Image affected by minor truncation artifact at capsule border, otherwise high SNR and strong peripheral signal.",
            "Low SNR T2-weighted scan with pronounced mottled noise and limited zonal contrast discrimination.",
            "High SNR image obtained using multi-channel surface coils, displaying superior peripheral zone clarity.",
            "T2-weighted image with mild aliasing artifact from undersampling, gland margins partially wrapped into FOV.",
            "High-contrast image with sharp capsular delineation and strong peripheral zone hyperintensity.",
            "Moderate SNR image affected by slight motion blur, peripheral capsule appears softened.",
            "Low-SNR image with poor gray-scale contrast, capsule barely perceptible against background signal.",
            "High SNR image demonstrating excellent anatomic resolution, minimal geometric distortion, and smooth texture.",
            "T2-weighted image with faint chemical shift banding between periprostatic fat and gland surface.",
            "Moderate SNR image with consistent intensity profile but mild banding artifact anteriorly.",
            "High SNR fast spin echo image with excellent zonal differentiation and visible internal ductal structures.",
            "Low SNR image exhibiting random speckle noise and reduced signal uniformity across axial slices.",
            "T2-weighted image with ghosting from cardiac motion, mild anterior streaking observed.",
            "High-quality image with sharp delineation of urethral lumen and minimal partial volume averaging.",
            "Moderate SNR image with visible ringing artifact near high-contrast interfaces, otherwise preserved definition.",
            "Low-contrast T2-weighted image due to suboptimal echo time, zones not clearly differentiated.",
            "T2-weighted image with excellent SNR, clear capsule definition, and minimal noise floor elevation.",
            "Image showing local field inhomogeneity near rectal wall, causing subtle posterior signal drop.",
            "High-resolution acquisition with faint truncation lines near lateral margins of the capsule.",
            "T2-weighted image with mild distortion from eddy currents, signal integrity largely preserved.",
            "Low SNR image with coarse noise pattern and reduced peripheral-to-transition zone contrast.",
            "High-quality image with smooth gradient intensity transitions and consistent fat suppression.",
            "T2-weighted scan showing slight motion ghosting from bowel peristalsis, gland boundary partially blurred.",
            "Moderate SNR image with asymmetric signal fall-off due to coil sensitivity variation.",
            "High-resolution image demonstrating uniform T2 contrast and clear internal nodular definition.",
            "Low SNR acquisition with mottled appearance and visible phase-encoding streak artifacts.",
            "T2-weighted image showing faint Gibbs ringing along rectoprostatic interface, high overall SNR.",
            "Moderate SNR image with clear gray-scale separation and minimal geometric distortion.",
            "High-quality image with excellent contrast-to-noise ratio, capsule clearly hypointense.",
            "Low-contrast image with diffuse noise distribution and indistinct zonal boundary.",
            "High SNR image demonstrating distinct delineation of anterior fibromuscular stroma and capsule.",
            "T2-weighted image with mild aliasing artifact across the superior gland region.",
            "Moderate SNR scan showing uniform intensity but slight peripheral blurring due to motion.",
            "Low SNR image with high-frequency noise, causing grainy peripheral zone texture.",
            "T2-weighted image with subtle motion-induced ghosting posteriorly and mild signal fall-off.",
            "High-contrast acquisition with clear hyperintense peripheral zone and hypointense capsule line.",
            "Low SNR image with evident coil dropout artifact anteriorly, peripheral zone barely visible.",
            "Moderate SNR T2-weighted scan with uniform gray-scale distribution and minor phase shift artifact.",
            "High-quality image with sharp structural delineation, minimal distortion, and optimal echo parameters.",
            "T2-weighted fast spin-echo image with moderate blurring, capsule margins slightly indistinct.",
            "Low SNR image with visible random speckle noise and decreased peripheral detail.",
            "High-resolution T2-weighted scan showing strong peripheral brightness and intact capsular hypointensity.",
            "Moderate SNR image with slight ghosting due to patient motion, gland still clearly visible."
        ]
    },
    "DeepSeek": {
        "prostate": [
            "Homogeneous hyperintense peripheral zone with well-defined hypointense capsule. Transition zone demonstrates mild heterogeneous signal with few small BPH nodules.",
            "Markedly heterogeneous transition zone with numerous mixed-signal BPH nodules creating lobulated architecture. Peripheral zone maintains uniform hyperintensity.",
            "Circumferential hypointense surgical capsule clearly demarcating transition zone from peripheral zone. Peripheral zone shows diffuse T2 hypointensity suggesting prostatitis.",
            "Asymmetric transition zone enlargement with dominant hypointense BPH nodule in left anterior region. Capsular definition remains intact bilaterally.",
            "Diffuse T2 hypointensity throughout peripheral zone with maintained zonal anatomy. Capsular margin shows focal bulging posterolaterally on right.",
            "Well-defined T2 hypointense focus in left peripheral zone at apex, measuring 1.2 cm, with maintained capsular integrity.",
            "Heterogeneous transition zone with 'organized chaos' pattern of mixed BPH nodules. Anterior fibromuscular stroma appears thickened and hypointense.",
            "Global gland enlargement with preserved zonal anatomy. Peripheral zone shows patchy T2 hyperintensity with cystic changes.",
            "Focal capsular irregularity at mid-gland posteriorly with adjacent T2 hypointense lesion extending to neurovascular bundle.",
            "Central zone appears as symmetric hypointense triangular structure at gland base. Peripheral zone demonstrates uniform T2 hyperintensity.",
            "Extensive BPH changes with numerous T2 hyperintense cystic nodules within transition zone. Surgical capsule appears thickened and hypointense.",
            "Diffuse T2 hypointensity effacing normal zonal anatomy. Capsular margin remains distinct though slightly irregular.",
            "Anterior fibromuscular stroma markedly hypointense and thickened. Peripheral zone shows focal T2 hypointense area in right mid-gland.",
            "BPH-dominated transition zone with 'streamer' pattern extending toward verumontanum. Peripheral zone maintains normal T2 hyperintensity.",
            "Focal T2 hypointense lesion at right base with extracapsular extension evidenced by neurovascular bundle encasement.",
            "Uniformly hypointense peripheral zone with loss of normal architecture. Transition zone shows early BPH changes with microcystic formation.",
            "Well-demarcated T2 hyperintense cystic nodule in transition zone measuring 0.8 cm. Peripheral zone shows mild diffuse T2 hypointensity.",
            "Asymmetric transition zone enlargement with dominant anterior component. Surgical capsule appears interrupted in several locations.",
            "Diffuse T2 hypointensity throughout gland with complete effacement of zonal boundaries. Capsular definition remains intact.",
            "Peripheral zone shows wedge-shaped T2 hypointense area extending from capsule to urethra, suggesting prostatitis.",
            "Marked BPH changes with mixed solid and cystic nodules. Peripheral zone demonstrates focal T2 hypointense nodule at left apex.",
            "Circumferential capsular thickening with maintained integrity. Peripheral zone shows heterogeneous T2 signal with areas of hypointensity.",
            "Transition zone demonstrates 'cloud-like' BPH nodules with heterogeneous signal. Anterior fibromuscular stroma appears atrophic.",
            "Focal T2 hypointense lesion in anterior transition zone with capsular deformity but no definite breach.",
            "Peripheral zone shows diffuse T2 hypointensity with several discrete hypointense nodules. Capsular margin remains sharp.",
            "Central zone hypertrophy with symmetric T2 hypointense expansion at base. Peripheral zone maintains normal architecture.",
            "Extensive cystic degeneration in transition zone with multiple T2 hyperintense cysts. Surgical capsule appears thin but intact.",
            "Focal capsular retraction adjacent to T2 hypointense lesion in left peripheral zone at mid-gland level.",
            "Diffuse glandular enlargement with homogeneous T2 hypointensity throughout both peripheral and transition zones.",
            "Well-defined T2 hypointense surgical capsule separating heterogeneous transition zone from uniformly hyperintense peripheral zone.",
            "Asymmetric peripheral zone T2 hypointensity, more pronounced on right side with maintained capsular integrity.",
            "Transition zone shows 'sponge-like' architecture with numerous small T2 hyperintense cystic spaces. Peripheral zone appears normal.",
            "Focal T2 hypointense area in anterior fibromuscular stroma with overlying capsular thickening.",
            "Peripheral zone demonstrates linear T2 hypointense bands radiating from capsule toward urethra, suggesting post-inflammatory changes.",
            "Marked transition zone enlargement with predominantly solid hypointense BPH nodules. Capsular definition remains sharp.",
            "Diffuse T2 hypointensity in peripheral zone with focal areas of signal void suggesting calcifications.",
            "Central zone appears prominent and hypointense, blending with transition zone. Peripheral zone shows patchy T2 hyperintensity.",
            "Focal capsular bulge with adjacent T2 hypointense mass in right peripheral zone at base level.",
            "Heterogeneous transition zone with 'swiss cheese' pattern of cystic and solid BPH nodules. Surgical capsule appears well-defined.",
            "Peripheral zone shows multifocal T2 hypointense lesions with maintained capsular integrity and zonal anatomy.",
            "Global gland enlargement with predominant transition zone hypertrophy. Peripheral zone compressed but maintains T2 hyperintensity.",
            "Focal T2 hypointense lesion at verumontanum level with extension into both peripheral and transition zones.",
            "Diffuse capsular thickening with maintained integrity. Peripheral zone shows homogeneous T2 hypointensity throughout.",
            "Transition zone demonstrates predominantly T2 hyperintense cystic BPH changes. Peripheral zone appears unremarkable.",
            "Asymmetric peripheral zone T2 hypointensity with focal capsular irregularity on left side at mid-gland.",
            "Central zone appears atrophic with maintained hypointensity. Peripheral zone shows diffuse T2 hypointensity with focal hyperintense areas.",
            "Marked BPH changes with 'grape cluster' pattern of nodules in transition zone. Surgical capsule appears thickened.",
            "Focal T2 hypointense lesion in anterior transition zone with capsular abutment but no definite invasion.",
            "Peripheral zone shows diffuse T2 hypointensity with loss of normal architecture but maintained capsular definition.",
            "Transition zone enlargement with mixed solid and cystic components. Peripheral zone demonstrates focal T2 hypointense area at right base.",
            "Circumferential capsular hypointensity with focal interruption posteriorly adjacent to T2 hypointense lesion.",
            "Diffuse glandular T2 hypointensity with complete loss of zonal differentiation. Capsular margin remains distinct.",
            "Peripheral zone shows multifocal T2 hypointense nodules with intervening areas of normal T2 hyperintensity.",
            "Transition zone demonstrates 'honeycomb' pattern of BPH nodules with heterogeneous signal. Surgical capsule appears thin.",
            "Focal T2 hypointense lesion in left peripheral zone with capsular retraction and neurovascular bundle involvement.",
            "Asymmetric transition zone enlargement with dominant hypointense nodule on right side. Peripheral zone appears normal.",
            "Diffuse peripheral zone T2 hypointensity with focal areas of capsular thickening but no definite breach.",
            "Central zone appears prominent and hypointense, merging with transition zone. Peripheral zone shows uniform T2 hyperintensity.",
            "Marked BPH changes with predominantly solid hypointense nodules. Peripheral zone compressed but maintains normal signal.",
            "Focal T2 hypointense area in anterior fibromuscular stroma with overlying capsular preservation.",
            "Peripheral zone shows linear T2 hypointense strands suggesting post-inflammatory changes. Capsular margin remains sharp.",
            "Transition zone enlargement with 'mixed bag' pattern of BPH nodules. Surgical capsule appears well-defined and hypointense.",
            "Focal capsular irregularity adjacent to T2 hypointense lesion in right peripheral zone at apex level.",
            "Diffuse glandular T2 hypointensity with maintained zonal anatomy. Capsular definition remains intact throughout.",
            "Peripheral zone demonstrates wedge-shaped T2 hypointense area with base at capsule, suggesting prostatitis.",
            "Transition zone shows predominantly cystic BPH changes with T2 hyperintense nodules. Peripheral zone appears unremarkable.",
            "Asymmetric peripheral zone T2 hypointensity with focal capsular thickening on left side at mid-gland.",
            "Central zone hypertrophy with symmetric T2 hypointense expansion. Peripheral zone shows patchy T2 hypointensity.",
            "Marked BPH changes with 'organized chaos' pattern in transition zone. Surgical capsule appears interrupted in several areas.",
            "Focal T2 hypointense lesion in anterior transition zone with capsular deformity but maintained integrity.",
            "Peripheral zone shows diffuse T2 hypointensity with complete loss of normal architecture. Capsular margin remains sharp.",
            "Transition zone enlargement with mixed signal BPH nodules. Peripheral zone demonstrates focal T2 hypointense area at left base.",
            "Circumferential capsular hypointensity with focal bulge anteriorly adjacent to T2 hypointense lesion.",
            "Diffuse glandular T2 hypointensity with effacement of zonal boundaries. Capsular definition remains intact.",
            "Peripheral zone shows multifocal T2 hypointense nodules with maintained capsular integrity and zonal anatomy.",
            "Transition zone demonstrates 'sponge-like' architecture with numerous small T2 hyperintense cysts. Surgical capsule appears thickened.",
            "Focal T2 hypointense lesion in left peripheral zone with capsular retraction and adjacent neurovascular bundle thickening.",
            "Asymmetric transition zone enlargement with dominant anterior component. Peripheral zone shows diffuse T2 hypointensity.",
            "Diffuse peripheral zone T2 hypointensity with focal areas of signal void suggesting calcifications. Capsular margin remains sharp.",
            "Central zone appears prominent and hypointense, blending with transition zone. Peripheral zone shows uniform T2 hyperintensity."
        ],
        "style": [
            "High signal-to-noise ratio with excellent soft tissue contrast between peripheral zone and transition zone.",
            "Moderate motion artifact causing blurring along the phase-encoding direction, reducing zonal boundary definition.",
            "Gibbs ringing artifacts at tissue interfaces creating alternating bright and dark lines along the capsule.",
            "Excellent contrast-to-noise ratio with clear differentiation between BPH nodules and normal transition zone tissue.",
            "Susceptibility artifacts from post-biopsy hemorrhage causing focal signal voids in the peripheral zone.",
            "Wrap-around artifact in the phase-encoding direction with anatomical structures appearing duplicated.",
            "High spatial resolution acquisition with minimal partial volume averaging and sharp capsular definition.",
            "Radiofrequency inhomogeneity causing regional variations in signal intensity across the gland.",
            "Parallel imaging artifacts manifesting as noise-like patterns in the phase-encoding direction.",
            "Optimal TR/TE parameters providing excellent T2 weighting with fluid appearing bright and fibrous tissue dark.",
            "Chemical shift artifact of the second kind creating black boundaries at fat-water interfaces.",
            "Flow-related artifacts from adjacent vessels causing pulsation ghosts in the phase-encoding direction.",
            "High bandwidth acquisition reducing chemical shift artifacts but with decreased signal-to-noise ratio.",
            "Truncation artifacts creating alternating bands of high and low signal at sharp tissue boundaries.",
            "Excellent dynamic range with preserved signal intensity differences between various tissue types.",
            "Zipper artifacts from RF interference creating linear artifacts across the image.",
            "3D acquisition with isotropic voxels allowing multi-planar reconstruction without resolution loss.",
            "Metal artifacts from hip prostheses causing extensive signal dropout and geometric distortion.",
            "Partial Fourier acquisition reducing scan time but introducing phase cancellation artifacts.",
            "Radial k-space sampling producing streak artifacts from high-contrast structures.",
            "Optimal echo train length maintaining good signal intensity while minimizing blurring.",
            "Magnet inhomogeneity causing regional variations in T2 weighting across the field of view.",
            "Parallel imaging with acceleration factor 2 introducing minimal noise amplification.",
            "Motion degradation from rectal peristalsis obscuring the prostate-rectal interface.",
            "Excellent magnetic field homogeneity providing uniform fat suppression throughout the FOV.",
            "Cross-excitation artifacts from imperfect slice profiles causing signal reduction.",
            "Variable flip angle evolution in 3D TSE providing consistent signal throughout echo train.",
            "Susceptibility-induced geometric distortion near air-tissue interfaces in rectum.",
            "High receiver bandwidth minimizing chemical shift artifact but with increased noise.",
            "Phase oversampling preventing wrap-around artifact in the phase-encoding direction.",
            "Optimal fat suppression using spectral adiabatic inversion recovery providing uniform fat nulling.",
            "Respiratory motion artifacts creating ghosting in the phase-encoding direction.",
            "Multi-channel phased-array coil providing excellent signal-to-noise ratio with uniform sensitivity.",
            "Dielectric effects causing central brightness artifact at 3T field strength.",
            "Magnetization transfer effects reducing signal from macromolecule-rich tissues.",
            "CS reconstruction artifacts from high acceleration factors creating textured noise patterns.",
            "Excellent B0 field homogeneity with minimal geometric distortion throughout prostate.",
            "Flow compensation gradients reducing pulsatility artifacts from adjacent vessels.",
            "Variable bandwidth in frequency-encoding direction optimizing SNR and chemical shift.",
            "Radial k-space undersampling creating streak artifacts through the gland.",
            "Optimal NEX/averaging providing excellent SNR with acceptable acquisition time.",
            "Motion-robust acquisition with PROPELLER technique reducing motion artifacts.",
            "Susceptibility-weighted imaging creating exaggerated contrast at tissue interfaces.",
            "Compressed sensing reconstruction allowing reduced acquisition time with minimal artifact.",
            "B1 inhomogeneity causing uneven excitation and signal variation across prostate.",
            "High-resolution acquisition with small voxel size reducing partial volume effects.",
            "Parallel imaging with GRAPPA reconstruction showing minor residual aliasing.",
            "Magnet drift causing gradual phase errors and image blurring.",
            "Optimal echo spacing minimizing blurring in turbo spin echo acquisition.",
            "Chemical shift selective saturation providing effective but incomplete fat suppression.",
            "Motion-triggered acquisition reducing artifacts from rectal and patient motion.",
            "Susceptibility artifact from calcifications creating focal signal voids.",
            "Variable flip angle design in 3D TSE providing uniform T2 contrast.",
            "Partial k-space acquisition in phase direction reducing scan time with minimal resolution loss.",
            "Dielectric pads improving B1 homogeneity and signal uniformity at 3T.",
            "Flow-related enhancement in vessels creating bright signal within vascular structures.",
            "Optimal slice gap preventing cross-talk between adjacent slices.",
            "Multi-echo acquisition with later echoes showing increased T2 weighting.",
            "Radial streak artifacts from high-contrast structures outside FOV.",
            "Parallel imaging with SENSE reconstruction showing minimal noise enhancement.",
            "Magnetic susceptibility variations creating geometric distortion near rectal air.",
            "Optimal receiver gain providing maximum dynamic range without signal clipping.",
            "Motion-compensated diffusion weighting reducing motion artifacts in T2 images.",
            "Chemical shift artifact displacing fat and water by several pixels.",
            "Variable bandwidth in readout direction optimizing chemical shift and SNR trade-off.",
            "Radial sampling with golden-angle spacing providing motion robustness.",
            "Parallel transmission compensating for B1 inhomogeneity at high field strengths.",
            "Optimal specific absorption rate management without compromising image quality.",
            "Motion artifacts from patient movement degrading capsular definition.",
            "Multi-shot acquisition reducing distortions but sensitive to motion between shots.",
            "Susceptibility-induced signal loss near tissue-air interfaces.",
            "Optimal shim providing excellent magnetic field homogeneity over prostate.",
            "Parallel imaging with high acceleration factor causing noise-like artifacts.",
            "Flow artifacts from iliac vessels creating ghosts across the prostate.",
            "Variable refocusing flip angles maintaining signal throughout long echo trains.",
            "Chemical shift of the first kind creating bright and dark bands at fat-water interfaces.",
            "Motion-insensitive single-shot acquisition with reduced spatial resolution.",
            "Optimal coil positioning providing uniform sensitivity across entire prostate.",
            "Dielectric resonance effects causing localized signal variation at 3T.",
            "Partial volume averaging at capsule interface reducing boundary definition."
        ]
    }
}