{
    "gemini": {
        "breast tumor": [
            "A simple anechoic cyst: oval, circumscribed, with a thin, imperceptible echogenic wall and prominent posterior acoustic enhancement.",
            "A solid, markedly hypoechoic, irregular mass with spiculated margins radiating into the surrounding parenchyma, causing significant architectural distortion.",
            "A classic fibroadenoma: solid, oval, circumscribed, gently lobulated, homogeneous, hypoechoic mass with parallel orientation and a thin echogenic pseudocapsule.",
            "A solid, irregular, markedly hypoechoic mass with angular margins and a 'taller-than-wide' (non-parallel) orientation, associated with posterior acoustic shadowing.",
            "A complex cystic and solid mass: a thick-walled, anechoic structure containing a solid, eccentric, hypoechoic mural nodule with microlobulated margins.",
            "An ill-defined, isoechoic, solid mass, identifiable primarily by the significant posterior acoustic shadowing and architectural distortion it creates.",
            "A circumscribed, macrolobulated, solid, hypoechoic mass with homogeneous internal echotexture and mild posterior acoustic enhancement.",
            "A solid, round, markedly hypoechoic mass with microlobulated margins and a surrounding thick, echogenic halo.",
            "A complicated cyst: a circumscribed, oval mass with homogeneous low-level internal echoes (debris) and posterior acoustic enhancement.",
            "A solid, hypoechoic, irregular mass with indistinct margins, blending into the surrounding echogenic breast tissue, with no posterior acoustic features.",
            "An anechoic, circumscribed, round mass with thin, smooth walls and prominent posterior acoustic enhancement, consistent with a simple cyst.",
            "A spiculated, irregular, hypoechoic mass with a non-parallel orientation, causing retraction of Cooper's ligaments and intense posterior shadowing.",
            "A parallel-oriented, oval, homogeneous, isoechoic mass with circumscribed margins, discernible from fat only by its thin, echogenic capsule and mass effect.",
            "A complex mass with multiple, thin, echogenic septations traversing a large anechoic lumen; margins are circumscribed.",
            "A solid, irregular, non-parallel, markedly hypoechoic mass with multiple angular margins and internal heterogeneous echotexture.",
            "A circumscribed, oval, hypoechoic, homogeneous mass with a parallel orientation, consistent with a benign-appearing solid nodule.",
            "A solid, hypoechoic mass with indistinct and angular margins, associated with duct extension, creating a branching, linear boundary.",
            "A clustered microcyst: a group of contiguous, small anechoic foci with intervening thin, echogenic septa, forming a microlobulated boundary.",
            "A round, circumscribed, complex mass with a fluid-debris level (anechoic superiorly, echogenic inferiorly) and posterior enhancement.",
            "An irregular, markedly hypoechoic, spiculated mass with echogenic extensions penetrating the pectoral fascia.",
            "A solid, round, circumscribed, homogeneous, markedly hypoechoic mass with slight posterior acoustic enhancement.",
            "A solid, hypoechoic mass with a microlobulated outline and a 'taller-than-wide' orientation, with faint posterior shadowing.",
            "An intracystic papilloma: a circumscribed anechoic cyst containing a solid, pedunculated, hypoechoic nodule attached to the cyst wall.",
            "An ill-defined, hypoechoic, heterogeneous mass with spiculated margins and multiple internal punctate echogenic foci (microcalcifications).",
            "A parallel, oval, circumscribed, anechoic mass with a thin, smooth wall and lateral edge shadowing.",
            "A solid, irregular, markedly hypoechoic mass with a thick, irregular, echogenic halo and indistinct posterior borders due to shadowing.",
            "A solid, parallel, oval mass with circumscribed, gently lobulated margins and a heterogeneous internal texture, including cystic clefts.",
            "A non-mass lesion: a focal area of architectural distortion with no discrete hypoechoic mass, characterized by radiating spicules and central shadowing.",
            "A circumscribed, round, anechoic mass with thick, irregular, echogenic walls and posterior acoustic enhancement.",
            "A solid, taller-than-wide, irregular, hypoechoic mass with angular margins and combined posterior acoustic shadowing and enhancement.",
            "A solid, parallel, hypoechoic mass with circumscribed anterior margins but an ill-defined, indistinct posterior margin blending with glandular tissue.",
            "A large, macrolobulated, heterogeneous mass with mixed solid (hypoechoic) and cystic (anechoic) components and circumscribed borders.",
            "A solid, irregular, hypoechoic mass with spiculated margins, located superficially and causing tethering and retraction of the skin.",
            "A circumscribed, oval, heterogeneous mass with a central echogenic scar and a hypoechoic rim.",
            "A solid, markedly hypoechoic, non-parallel, round mass with angular and microlobulated margins.",
            "An anechoic, circumscribed mass with homogeneous, gravity-dependent, low-level internal echoes and a well-defined posterior wall.",
            "A solid, isoechoic, irregular mass with spiculated margins, creating architectural distortion; the mass itself is difficult to segment from fat.",
            "A parallel, oval, circumscribed, hypoechoic mass with homogeneous texture and a clear, thin, echogenic capsule.",
            "A solid, hypoechoic, taller-than-wide mass with ill-defined, indistinct margins and significant posterior acoustic shadowing.",
            "A complex mass with a solid, hypoechoic, mural component and a large anechoic, cystic component, with a sharply defined outer wall.",
            "A solid, irregular, hypoechoic mass with a branching, intraductal pattern, following the duct system, creating an complex boundary.",
            "A round, circumscribed, markedly hypoechoic mass with a central anechoic area (necrosis) and a thick, irregular, solid rim.",
            "A solid, hypoechoic, microlobulated mass with a parallel orientation and heterogeneous internal echotexture.",
            "An irregular, spiculated, isoechoic mass, identifiable only by the strong posterior acoustic shadow and retraction of surrounding tissue.",
            "A circumscribed, complex mass with an anechoic lumen, thick echogenic walls, and internal septations.",
            "A solid, irregular, markedly hypoechoic mass with angular margins and an echogenic halo, demonstrating a non-parallel orientation.",
            "A parallel, oval, circumscribed, homogeneous, hypoechoic mass with a distinct, smooth pseudocapsule.",
            "A solid, hypoechoic mass with indistinct anterior margins and a completely obscured posterior margin due to intense acoustic shadowing.",
            "A large, circumscribed, oval mass with heterogeneous echotexture, containing multiple anechoic (necrotic) spaces.",
            "A solid, irregular, hypoechoic, non-parallel mass with spiculated margins extending to the chest wall.",
            "A circumscribed, oval, anechoic mass with a single, thin, internal echogenic septum and posterior enhancement.",
            "A solid, hypoechoic mass with a microlobulated, non-circumscribed margin and heterogeneous internal echotexture.",
            "An ill-defined, hypoechoic mass with angular margins and associated echogenic duct extension towards the nipple.",
            "A solid, round, circumscribed, homogeneous, markedly hypoechoic mass with no posterior acoustic features.",
            "A spiculated, irregular, heterogeneous, hypoechoic mass with internal punctate echogenic foci and posterior shadowing.",
            "A circumscribed, bi-lobed, hypoechoic, homogeneous mass with a parallel orientation and thin echogenic capsule.",
            "A solid, irregular, taller-than-wide, hypoechoic mass with ill-defined, indistinct margins and a thick echogenic halo.",
            "A well-defined, anechoic, oval mass with homogeneous low-level internal echoes and a fluid-fluid level.",
            "A solid, irregular, hypoechoic mass with spiculated margins, causing retraction and architectural distortion of the superficial fascial plane.",
            "A circumscribed, parallel, oval, hypoechoic mass with homogeneous echotexture and gentle macrolobulations.",
            "A non-parallel, irregular, solid, hypoechoic mass with angular margins and a heterogeneous echotexture.",
            "A complex, multicystic mass with a 'cluster of grapes' appearance: multiple small anechoic locules with thin, intervening septa.",
            "A solid, hypoechoic mass with an ill-defined, spiculated posterior margin and a circumscribed anterior margin.",
            "A superficial, irregular, hypoechoic, non-parallel mass with indistinct margins and echogenic extension to the dermis.",
            "A solid, oval, circumscribed, isoechoic, homogeneous mass, clearly demarcated by a thin, surrounding echogenic rim.",
            "A solid, round, markedly hypoechoic mass with microlobulated margins and significant posterior acoustic enhancement.",
            "An irregular, heterogeneous mass with indistinct, angular margins and associated posterior acoustic shadowing.",
            "A circumscribed, anechoic, oval mass with a thick, irregular, solid mural component, consistent with an intracystic carcinoma.",
            "A solid, hypoechoic, taller-than-wide mass with spiculated margins and internal echogenic calcifications.",
            "A circumscribed, macrolobulated, parallel, hypoechoic mass with a heterogeneous texture due to internal anechoic clefts.",
            "A solid, irregular, hypoechoic mass with indistinct margins, causing architectural distortion; the posterior boundary is obscured by shadowing.",
            "A round, circumscribed, complex mass with a solid, hypoechoic, eccentric nodule within a predominantly anechoic (cystic) structure.",
            "A solid, irregular, markedly hypoechoic mass with spiculated margins, a non-parallel orientation, and a prominent echogenic halo.",
            "A parallel, oval, circumscribed, hypoechoic mass with a central echogenic focus (scar) and homogeneous surrounding tissue.",
            "A solid, hypoechoic, microlobulated, non-parallel mass with heterogeneous internal texture and posterior shadowing.",
            "An anechoic, simple cyst with a sharply defined, smooth, posterior wall and strong posterior acoustic enhancement.",
            "An ill-defined, hypoechoic mass with spiculated margins, causing tenting of the skin and retraction of Cooper's ligaments.",
            "A solid, round, circumscribed, homogeneous, hypoechoic mass with a parallel orientation and a thin, echogenic capsule.",
            "A solid, irregular, hypoechoic mass with angular margins and a heterogeneous texture, including punctate echogenic foci.",
            "A complex, circumscribed, oval mass with mixed solid (hypoechoic) and cystic (anechoic) components, giving a heterogeneous appearance."
        ],
        "style": [
            "High-contrast image with a low dynamic range setting, resulting in saturated hyperechoic structures and stark, anechoic cystic components.",
            "Low-contrast image with a high dynamic range, presenting a 'soft' or 'grayed-out' appearance with subtle differentiation between the hypoechoic mass and adjacent tissue.",
            "Globally over-gained image, causing a 'washed-out' or 'snow-storm' effect where anechoic spaces are filled with low-level echoes and speckle is prominent.",
            "Globally under-gained image, resulting in poor signal penetration and a dark, 'muddy' appearance, obscuring the posterior tumor margin.",
            "Image with improperly set Time Gain Compensation (TGC), showing distinct horizontal banding of brightness, saturating the near-field and 'blacking out' the far-field.",
            "High-resolution image from a high-frequency linear probe (>12 MHz), demonstrating a fine speckle texture and crisp, sharply defined tumor boundaries.",
            "Low-resolution image, likely from a lower-frequency probe (<7 MHz), characterized by a coarse, 'blocky' speckle pattern and blurry, indistinct tumor margins.",
            "Image with aggressive speckle reduction (SRI) applied, giving a 'smoothed', 'painted', or 'plastic' texture that reduces noise but may obscure fine spicules.",
            "Image with speckle reduction off or low, presenting a 'raw', grainy, salt-and-pepper texture, high in acoustic speckle noise.",
            "Low signal-to-noise ratio (SNR) image, with significant electronic 'hiss' or noise visible in anechoic regions and the far-field.",
            "High signal-to-noise ratio (SNR) image, characterized by 'clean' anechoic spaces (deep black) and a clear, well-defined tissue echotexture.",
            "Image captured with Tissue Harmonic Imaging (THI) enabled, showing enhanced contrast, reduced near-field artifact, and clearer cyst definition.",
            "Image captured using fundamental imaging (THI off), displaying more 'haze', prominent near-field reverberation artifacts, and lower overall contrast.",
            "Image with spatial compounding (e.g., CrossXBeam, SonoCT) enabled, resulting in reduced speckle and artifacts, but with 'softened' or 'blurred' posterior acoustic shadowing.",
            "Image without spatial compounding, showing 'classic' sharp acoustic artifacts (shadowing and enhancement) and a more 'raw', less-processed speckle texture.",
            "Image dominated by prominent posterior acoustic shadowing, creating a 'clean' anechoic stripe extending from the tumor to the image base.",
            "Image characterized by significant posterior acoustic enhancement, causing an artifactually bright, 'white-out' region deep to the mass.",
            "Image showing distinct 'edge shadowing' or 'refractive' artifact, appearing as dark, anechoic vertical bands descending from the curved lateral edges of the tumor.",
            "Near-field image corrupted by 'reverberation' artifact, visible as bright, equidistant, parallel horizontal lines obscuring superficial structures.",
            "Image with a 'mirror image' artifact, where the tumor is artifactually duplicated on the opposite side of the pectoral muscle (a strong reflector).",
            "Image with 'side lobe' artifact, placing low-level artifactual echoes from the main tumor mass into an adjacent, otherwise simple, anechoic cyst.",
            "High 'clutter' signal present, filling an anechoic structure with low-level echoes, mimicking a complex cyst or solid debris.",
            "Image with poor lateral resolution, causing a 'smearing' effect on structures perpendicular to the beam and blurring the side walls of the tumor.",
            "Image with poor axial resolution, resulting in 'blurry' or 'thickened' anterior and posterior tumor walls.",
            "Image with incorrect focal zone placement (set too shallow), causing the deep-seated tumor to appear out-of-focus and blurred.",
            "Image using multiple focal zones, resulting in high lateral resolution throughout the field of view, but a noticeably slower frame rate.",
            "A 'hard' preset with a low dynamic range and edge enhancement, making the tumor 'pop' with a stark, well-defined boundary against the parenchyma.",
            "A 'soft' preset with a high dynamic range and smoothing, resulting in a low-contrast image where an isoechoic tumor's borders blend into the surrounding tissue.",
            "Image with a very 'fine' or 'tight' speckle pattern, indicative of a high-end system with advanced processing.",
            "Image with a 'coarse' or 'blotchy' echotexture, suggestive of an older machine or a low-frequency preset.",
            "Image with high persistence (frame averaging), causing a 'lag' or 'smearing' effect with probe movement, but a smoother static image.",
            "Image with low persistence (high frame rate), appearing 'flickery' but highly responsive, with more visible noise.",
            "Image with 'edge enhancement' post-processing, creating an artificially bright, echogenic 'halo' or outline around the tumor boundary.",
            "Vendor-specific preset 'A', characterized by aggressive spatial compounding and a very 'processed,' smooth echotexture.",
            "Vendor-specific preset 'B', characterized by high-contrast resolution and distinct, well-defined 'sharp' speckle.",
            "Vendor-specific preset 'C', characterized by a soft, medium-contrast texture and moderate speckle reduction.",
            "Image with a 'slice-thickness' (Z-axis) artifact, causing partial volume averaging that fills in a small cyst, making it appear hypoechoic or solid.",
            "Image with high compression (low dynamic range), where the tumor's internal texture is 'crushed' to a uniform, homogeneous black.",
            "Image with low compression (high dynamic range), revealing subtle, heterogeneous internal echoes within a hypoechoic mass.",
            "Image from a 'wide-field-of-view' or 'panoramic' acquisition, stitched together, which may show 'seam' artifacts or slight misalignment.",
            "Image captured with an 'extended' or 'trapezoidal' field of view on a linear probe, showing beam divergence and decreased resolution at the lateral edges.",
            "Strongly anisotropic image, where the echogenicity of muscle tissue changes dramatically from hyperechoic to hypoechoic with slight probe angulation.",
            "Image with a 'beam width' artifact, overestimating the width of a small, bright calcification, making it appear 'smeared' laterally.",
            "High-contrast preset where the tumor's internal structure is 'bottomed out' to pure black, obscuring any internal septations or debris.",
            "Low-contrast 'penetration' preset, resulting in a 'hazy' image with reduced resolution, used for a very deep tumor.",
            "Image with saturated gain in the focal zone, creating a 'bright horizontal band' that obscures tumor details at that specific depth.",
            "Image with 'comet-tail' artifact (a form of reverberation) streaming from bright, punctate internal microcalcifications.",
            "Image with a 'split-screen' view, showing the grayscale image adjacent to an elastography map, a common stylistic presentation.",
            "Image with a 'split-screen' view, showing the grayscale image adjacent to a color Doppler image, highlighting vascularity.",
            "Image with a very shallow depth setting, 'zooming in' on a superficial lesion, resulting in a large, magnified appearance with high-resolution speckle.",
            "Image with an excessive depth setting, making the tumor appear very small in the near-field, wasting screen space and reducing the frame rate.",
            "Image with high-gain 'noise' in the far-field, appearing as a 'fuzzy' gray band at the bottom of the screen.",
            "Image with heavy 'clutter' artifact from chest wall motion, appearing as bright 'flashes' or 'bands' originating from the pectoral muscle.",
            "Image from a standoff pad, which introduces an artifactual 'dead space' at the top of the image but improves near-field focusing.",
            "A 'con-focal' or 'single-focus' preset, resulting in a very high-resolution image at the focal point, but significant 'blurring' above and below it.",
            "Image showing prominent 'acoustic streaming' in a cyst during color Doppler, but appearing as 'moving echoes' on the grayscale B-mode.",
            "Image with a 'grainy' texture due to high-frequency probe use at maximum depth, leading to signal 'drop-out' and low SNR in the far-field.",
            "Image preset with 'auto-optimization' (e.g., 'ATO'), resulting in a 'balanced' but sometimes 'generic' contrast and brightness level.",
            "Image with a 'hazy' quality due to poor probe-skin contact, introducing air and 'dirty' shadowing artifacts.",
            "Image with high-level smoothing (SRI) that artifactually 'connects' two adjacent small cysts, making them appear as a single, lobulated structure.",
            "Image with a 'raw' data feel, high speckle amplitude, and clearly visible 'scan lines', indicating minimal post-processing.",
            "A high-contrast, high-frequency image where the echogenic 'halo' around a tumor is 'blooming' or 'glowing' due to high gain and edge enhancement.",
            "Image with a very 'flat' or 'dull' texture, from high dynamic range and low gain, making differentiation of structures difficult.",
            "Image with 'speed displacement' artifact, causing a structure deep to a large silicone implant to appear misregistered or 'broken'.",
            "Image from a 3D acquisition (static), rendered as a 2D 'slice', often showing a finer 'voxel' texture compared to standard 2D.",
            "Image from a 3D acquisition (static), rendered in a 'multi-planar' view (coronal, sagittal, axial), a distinct stylistic format.",
            "Image with a 'sector' field of view, like from a phased array probe (uncommon for breast), showing a 'pie-slice' shape with a narrow near-field.",
            "Image from a curvilinear probe (uncommon for breast), showing a 'curved-top' field of view and diverging scan lines, with lower frequency and resolution.",
            "Image with 'volume averaging' artifact, where the curved edge of the tumor 'blends' with adjacent bright fat, creating a 'pseudo-capsule' or 'hazy' border.",
            "Image with THI and spatial compounding, where a spiculated margin appears 'filled in' and 'less distinct' than with fundamental imaging.",
            "Image with a 'despeckle' filter that creates small, 'patchy' or 'splotchy' areas of uniform gray, an artifact of heavy processing.",
            "A high-frequency image with 'band-like' reverberation artifact descending from a bright, superficial scar.",
            "Image with strong 'refractive shadowing' from Cooper's ligaments, creating vertical dark lines that can mimic or obscure a mass.",
            "Image with a preset 'label' or 'annotation' burned into the pixels, a common variation in clinical data (e.g., 'RT BREAST 12:00 2CM FN').",
            "Image with 'caliper' markings present, superimposing bright white lines and 'plus' symbols over the tumor for measurement.",
            "Image with a 'body mark' graphic, a small diagram indicating probe position, superimposed in one corner.",
            "A 'zoomed' or 'write-zoom' image, which is a magnified portion of the original scan, often appearing 'blocky' or 'pixelated' with lower resolution.",
            "A 'read-zoom' image, which is a magnified view without re-acquiring data, preserving the original pixel density but simply enlarging it.",
            "Image with a 'burnt-out' near-field, where high gain settings saturate the signal in the superficial layers, obscuring the skin line.",
            "Image with a 'deep focus' preset, resulting in a 'soft' or 'blurry' near-field, but a sharp and clear image of the pectoral muscle."
        ]
    },
    "GPT5": {
        "breast tumor": [
            "Well-circumscribed oval hypoechoic mass with thin echogenic capsule and uniform internal echoes.",
            "Irregular spiculated hypoechoic lesion with indistinct margins and posterior acoustic shadowing.",
            "Lobulated hypoechoic mass with partially defined margins and minimal posterior enhancement.",
            "Microlobulated heterogeneous mass with angular margins and internal echogenic foci suggestive of calcifications.",
            "Round anechoic lesion with smooth walls and strong posterior acoustic enhancement consistent with a simple cyst.",
            "Complex cystic and solid mass with internal septations and mural nodularity.",
            "Ill-defined hypoechoic area with peripheral hyperechoic rim indicating a desmoplastic reaction.",
            "Heterogeneous solid lesion with irregular shape, nonparallel orientation, and posterior attenuation.",
            "Well-defined oval hypoechoic mass with gentle lobulations and homogeneous echotexture.",
            "Spiculated mass with ill-defined margins and posterior acoustic shadowing extending into adjacent fat.",
            "Irregular hypoechoic lesion with indistinct boundaries and internal vascularity on color Doppler.",
            "Heterogeneous hypoechoic mass with angular margins and mild posterior shadowing.",
            "Oval isoechoic lesion with thin echogenic margin and posterior acoustic enhancement.",
            "Heterogeneous mass with mixed cystic and solid components and irregular internal septations.",
            "Irregular hypoechoic area with noncircumscribed margins and subtle posterior shadowing.",
            "Round hypoechoic mass with smooth margins and compressible consistency suggestive of benignity.",
            "Irregular hypoechoic lesion with microlobulated contour and internal echogenic lines.",
            "Hypoechoic mass with angular margins and posterior acoustic shadowing disrupting Cooper’s ligaments.",
            "Well-circumscribed oval lesion with parallel orientation and homogeneous echotexture.",
            "Heterogeneous hypoechoic lesion with indistinct margins and partial posterior attenuation.",
            "Irregular solid-cystic mass with thick internal septa and mural nodules.",
            "Spiculated hypoechoic lesion with nonparallel orientation and marked posterior shadowing.",
            "Microlobulated hypoechoic nodule with surrounding echogenic halo indicating infiltration.",
            "Well-circumscribed anechoic lesion with thin posterior enhancement and no internal echoes.",
            "Irregular heterogeneous lesion with ill-defined border blending with adjacent parenchyma.",
            "Oval hypoechoic mass with well-defined borders and mild posterior enhancement.",
            "Complex lesion with cystic and echogenic solid areas and internal vascular flow.",
            "Heterogeneous hypoechoic irregular mass with nonparallel axis and shadowing tail.",
            "Ill-defined hypoechoic area with spiculated contour and dense posterior acoustic shadow.",
            "Oval homogeneous hypoechoic lesion with smooth contour and compressible borders.",
            "Lobulated hypoechoic lesion with heterogeneous internal echoes and partial shadowing.",
            "Irregular solid hypoechoic mass with posterior shadowing and echogenic boundary.",
            "Oval hypoechoic nodule with sharp margins and posterior acoustic enhancement.",
            "Microlobulated heterogeneous lesion with angular margins and posterior attenuation.",
            "Irregular hypoechoic mass with indistinct spiculated margins and desmoplastic extension.",
            "Heterogeneous solid-cystic mass with irregular septations and variable echogenicity.",
            "Ill-defined hypoechoic lesion with indistinct boundary and posterior shadowing.",
            "Well-circumscribed oval lesion with smooth contour and homogeneous hypoechoic texture.",
            "Irregular microlobulated lesion with posterior attenuation and heterogeneous echotexture.",
            "Spiculated hypoechoic mass with nonparallel axis and ill-defined borders.",
            "Round anechoic lesion with smooth margins, posterior enhancement, and no internal debris.",
            "Irregular heterogeneous lesion with posterior acoustic shadowing and spiculated contour.",
            "Oval homogeneous hypoechoic mass with parallel orientation and thin echogenic capsule.",
            "Complex mass with thick septations, mixed echogenicity, and internal solid components.",
            "Hypoechoic irregular lesion with angular margins and posterior acoustic attenuation.",
            "Well-defined oval lesion with homogeneous low-level internal echoes and posterior enhancement.",
            "Spiculated hypoechoic lesion with radial extensions and posterior shadowing.",
            "Ill-defined irregular mass with heterogeneous echotexture and posterior attenuation.",
            "Lobulated hypoechoic mass with indistinct margins and mild posterior enhancement.",
            "Microlobulated solid lesion with heterogeneous internal echoes and nonparallel orientation.",
            "Oval homogeneous hypoechoic lesion with sharp margins and posterior acoustic enhancement.",
            "Irregular hypoechoic lesion with angular borders and posterior shadowing pattern.",
            "Heterogeneous hypoechoic mass with ill-defined contour and desmoplastic reaction.",
            "Well-circumscribed round lesion with homogeneous hypoechoic echotexture and smooth contour.",
            "Irregular solid lesion with nonparallel orientation, angular margins, and posterior shadowing.",
            "Complex mass with mixed solid and cystic components and thick internal septations.",
            "Spiculated irregular hypoechoic mass with posterior acoustic attenuation and blurred edges.",
            "Oval homogeneous hypoechoic lesion with smooth border and compressible consistency.",
            "Microlobulated hypoechoic lesion with posterior attenuation and heterogeneous echotexture.",
            "Irregular hypoechoic lesion with angular margins and surrounding echogenic halo.",
            "Well-circumscribed oval hypoechoic lesion with gentle lobulations and posterior enhancement.",
            "Irregular spiculated mass with heterogeneous echotexture and posterior shadowing.",
            "Oval homogeneous hypoechoic nodule with parallel axis and smooth echogenic border.",
            "Ill-defined hypoechoic lesion with nonparallel axis and posterior acoustic attenuation.",
            "Lobulated heterogeneous lesion with angular margins and partial posterior enhancement.",
            "Irregular hypoechoic mass with spiculated contour and desmoplastic tissue reaction.",
            "Heterogeneous solid-cystic lesion with internal septations and mural echogenic focus.",
            "Oval hypoechoic mass with sharp borders, parallel axis, and mild posterior enhancement.",
            "Spiculated irregular hypoechoic lesion with posterior shadowing and architectural distortion.",
            "Round homogeneous hypoechoic lesion with smooth wall and posterior enhancement.",
            "Irregular heterogeneous mass with indistinct borders and posterior acoustic shadowing.",
            "Lobulated hypoechoic lesion with heterogeneous internal texture and posterior enhancement.",
            "Ill-defined hypoechoic mass with angular margins and posterior attenuation.",
            "Well-circumscribed oval hypoechoic lesion with homogeneous texture and echogenic rim.",
            "Irregular spiculated hypoechoic mass with marked posterior shadowing and desmoplastic changes.",
            "Oval homogeneous hypoechoic mass with smooth contour and posterior enhancement.",
            "Complex lesion with cystic and solid areas, internal septa, and mural nodularity.",
            "Microlobulated irregular hypoechoic lesion with posterior acoustic attenuation.",
            "Well-circumscribed round anechoic lesion with smooth border and posterior enhancement.",
            "Irregular heterogeneous hypoechoic lesion with indistinct contour and posterior shadowing."
        ],
        "style": [
            "High-contrast B-mode image with excellent signal-to-noise ratio and minimal speckle artifact.",
            "Low-contrast image exhibiting elevated noise floor and reduced lesion conspicuity due to poor gain adjustment.",
            "Ultrasound frame with strong posterior acoustic shadowing and moderate speckle suppression filter applied.",
            "Image with enhanced edge definition via spatial compounding, yielding reduced speckle but softer texture.",
            "Low dynamic range image with over-compression leading to loss of subtle echotextural detail.",
            "High-frequency transducer image with fine structural resolution and low penetration depth.",
            "Low-frequency transducer image with increased depth penetration but decreased margin sharpness.",
            "Image affected by motion blur artifact reducing boundary delineation around the lesion.",
            "High dynamic range rendering with optimized gray-scale mapping enhancing hypoechoic region contrast.",
            "Low signal-to-noise ratio image dominated by granular speckle interference across the field.",
            "Image demonstrating posterior acoustic enhancement artifact increasing brightness beneath cystic areas.",
            "Image with shadowing artifacts extending from calcific foci obscuring posterior parenchyma.",
            "Frame exhibiting reverberation artifact near the skin line affecting superficial tissue clarity.",
            "Elastography overlay image with high contrast strain map superimposed on the B-mode background.",
            "Speckle-rich image captured without compound imaging, displaying coarse granular texture.",
            "Ultrasound image with logarithmic compression causing nonlinear gray-scale intensity distribution.",
            "Image with time-gain compensation improperly adjusted, resulting in hyperechoic superficial layers.",
            "Frame showing clutter artifact from near-field echoes degrading superficial lesion visibility.",
            "High-resolution harmonic imaging mode reducing clutter and improving boundary definition.",
            "Low-contrast harmonic image with diminished lesion-to-tissue differentiation.",
            "Image affected by side-lobe artifact creating false echogenic extensions near lesion margins.",
            "Tissue harmonic image with improved lateral resolution but reduced signal intensity in deep layers.",
            "Image with compound imaging artifacts causing blurred boundary representation of the tumor.",
            "Ultrasound frame with poor focus placement resulting in loss of detail within lesion core.",
            "Image showing improved depth-dependent gain correction enhancing posterior lesion visibility.",
            "B-mode image with inadequate dynamic range compression yielding flattened gray-scale distribution.",
            "Image with high speckle noise masking internal heterogeneity of the hypoechoic mass.",
            "Frame with speckle reduction filter applied aggressively, causing artificial smoothing of texture.",
            "High-contrast harmonic image emphasizing echogenic rim around the lesion.",
            "Image affected by acoustic clutter from chest wall reflections degrading deep tissue detail.",
            "Low signal intensity image with strong attenuation through dense glandular tissue.",
            "Image with well-balanced gain and contrast providing optimal delineation of lesion boundaries.",
            "B-mode frame demonstrating depth-dependent noise with reduced SNR in deeper tissues.",
            "Image with mild lateral streak artifact affecting posterior acoustic region visualization.",
            "Ultrasound frame captured with excessive dynamic range producing washed-out appearance.",
            "Frame with speckle decorrelation pattern indicative of compounded acquisition settings.",
            "Image showing strong posterior enhancement increasing echogenicity beneath cystic component.",
            "Image affected by refraction artifact distorting posterior lesion contour.",
            "Harmonic imaging frame with reduced speckle variance improving lesion detection.",
            "Low-quality image with excessive noise amplification from improper receiver gain.",
            "High-resolution scan with well-defined micro-lobulated contour and minimal speckle noise.",
            "Frame exhibiting beam-width artifact leading to slight lateral smearing of lesion edges.",
            "Low dynamic range image resulting in poor separation between hypoechoic and isoechoic regions.",
            "Image with proper focus zone placement maximizing central lesion definition.",
            "Frame showing echo dropout artifact within the lesion due to high attenuation core.",
            "High dynamic range image with optimized contrast curves enhancing internal texture.",
            "Image captured with poor probe-skin contact leading to nonuniform near-field brightness.",
            "B-mode frame exhibiting acoustic mirror artifact from adjacent fascial interface.",
            "Image showing high spatial resolution but low SNR due to high-frequency attenuation.",
            "Image captured using spatial compounding producing smooth but slightly blurred edges.",
            "Frame with over-gained acquisition resulting in blooming artifact around echogenic structures.",
            "Image demonstrating posterior acoustic shadowing artifact from dense malignant core.",
            "Image with harmonic and compound imaging combined, showing reduced speckle and improved contrast.",
            "Ultrasound frame with poor lateral resolution causing indistinct lesion margins.",
            "Frame with enhanced contrast resolution using adaptive dynamic range control.",
            "Low-quality scan exhibiting depth-dependent speckle artifact and uneven brightness distribution.",
            "Image with bright acoustic enhancement under cystic region and shadowing under solid areas.",
            "Image showing reverberation artifact distorting anterior lesion surface appearance.",
            "High signal-to-noise image with balanced dynamic range and uniform illumination across field.",
            "Image captured at oblique insonation angle creating anisotropic echogenicity variation.",
            "Low-contrast scan showing poor gray-scale separation between fat lobules and lesion tissue.",
            "Harmonic imaging frame with reduced clutter noise and enhanced edge contrast.",
            "Frame exhibiting ring-down artifact near posterior lesion border due to trapped air bubbles.",
            "Image with speckle contrast preserved but slightly increased due to narrow-bandwidth transducer.",
            "High dynamic range frame capturing subtle hypoechoic changes within heterogeneous lesion.",
            "Image showing posterior acoustic enhancement with increased distal signal intensity.",
            "Ultrasound frame with mild reverberation and multipath artifact near the lesion base.",
            "B-mode image exhibiting shadowing gradient caused by uneven tissue density.",
            "Image with proper dynamic gain calibration yielding optimal balance of brightness and contrast.",
            "Frame with low SNR and elevated speckle variance in deep parenchymal regions.",
            "High-contrast frame highlighting sharp echogenic transitions along lesion periphery.",
            "Image showing near-field dropout artifact masking superficial lesion boundaries.",
            "Frame demonstrating nonuniform time-gain compensation creating gradient brightness shift.",
            "Image with improved edge detection via spatial averaging and reduced noise floor.",
            "Low-quality image dominated by beam distortion artifact reducing lateral accuracy.",
            "Harmonic imaging scan with subtle posterior attenuation improving diagnostic contrast.",
            "Frame showing smooth speckle pattern due to compound averaging over multiple insonation angles.",
            "Image exhibiting side-lobe interference artifact generating false hyperechoic spots.",
            "High-quality image with optimized frequency and gain achieving maximal SNR and lesion contrast.",
            "Low-contrast image with inadequate gray-scale mapping flattening echogenic differences."
        ]
    },
    "DeepSeek": {
        "breast tumor": [
            "Hypoechoic mass with irregular, spiculated margins and posterior acoustic shadowing.",
            "Circumscribed, oval, anechoic mass with thin capsule and enhanced through transmission.",
            "Irregular hypoechoic lesion with angular margins and mild posterior acoustic shadowing.",
            "Complex cystic mass with thick septations and internal debris requiring segmentation of both fluid and solid components.",
            "Oval, parallel-oriented mass with microlobulated margins and isoechoic parenchymal texture.",
            "Hypoechoic mass with indistinct margins and no posterior acoustic features.",
            "Round, circumscribed mass with heterogeneous echotexture and mild posterior enhancement.",
            "Irregular hypoechoic lesion with spiculated margins and marked posterior acoustic shadowing.",
            "Mass with mixed echogenicity, containing both hypoechoic and hyperechoic components with indistinct boundaries.",
            "Oval hypoechoic mass with circumscribed margins and subtle posterior acoustic enhancement.",
            "Complex mass with cystic components, internal echoes, and irregular thick wall segmentation.",
            "Irregular mass with angular margins and surrounding architectural distortion.",
            "Hypoechoic lesion with microlobulated margins and parallel orientation to skin surface.",
            "Mass with eggshell calcifications requiring precise boundary delineation of calcified rim.",
            "Circumscribed anechoic cyst with thin, imperceptible wall and posterior acoustic enhancement.",
            "Hypoechoic mass with irregular margins and extension into surrounding fatty tissue.",
            "Oval mass with indistinct margins and heterogeneous internal echotexture.",
            "Irregular hypoechoic lesion with branch pattern extension into ductal structures.",
            "Mass with spiculated margins and central hyperechoic focus representing fibrosis.",
            "Complex cystic lesion with intracystic papillary projection requiring 3D boundary definition.",
            "Hypoechoic mass with circumscribed anterior margin but indistinct posterior boundary.",
            "Irregular lesion with angular margins and surrounding tissue edema manifesting as hyperechoic halo.",
            "Oval, parallel mass with circumscribed margins and homogeneous hypoechoic internal texture.",
            "Mass with mixed echogenicity and microcalcifications clustered in hypoechoic regions.",
            "Hypoechoic lesion with lobulated contours and mild posterior acoustic shadowing.",
            "Circumscribed mass with heterogeneous echotexture containing both cystic and solid components.",
            "Irregular hypoechoic mass with spiculated margins and architectural distortion of Cooper's ligaments.",
            "Complex mass with fluid-debris level requiring segmentation of interface boundary.",
            "Oval mass with indistinct margins and posterior acoustic enhancement.",
            "Hypoechoic lesion with irregular borders and extension to pectoral muscle interface.",
            "Mass with circumscribed margins but heterogeneous internal architecture with hyperechoic foci.",
            "Irregular hypoechoic lesion with microlobulated margins and no posterior acoustic features.",
            "Complex mass with thick, irregular wall and internal septations exceeding 0.5mm thickness.",
            "Oval, parallel-oriented hypoechoic mass with circumscribed margins and homogeneous texture.",
            "Mass with spiculated margins and shadowing that obscures posterior boundary definition.",
            "Hypoechoic lesion with angular margins and surrounding hyperechoic parenchymal changes.",
            "Circumscribed mass with anechoic center and thin, well-defined capsule.",
            "Irregular hypoechoic mass with indistinct margins and posterior acoustic enhancement.",
            "Complex lesion with both circumscribed and indistinct margin segments in different quadrants.",
            "Oval mass with microlobulated margins and isoechoic texture relative to surrounding parenchyma.",
            "Hypoechoic lesion with irregular contours and ductal extension pattern.",
            "Mass with circumscribed anterior border but spiculated posterior margin.",
            "Complex cystic structure with multiple loculations requiring separate compartment segmentation.",
            "Irregular hypoechoic mass with angular margins and mild posterior acoustic shadowing.",
            "Oval, parallel-oriented lesion with indistinct margins and heterogeneous echotexture.",
            "Mass with eggshell calcification and central hypoechoic component requiring dual boundary definition.",
            "Hypoechoic lesion with spiculated margins and acoustic shadowing obscuring deep boundary.",
            "Circumscribed mass with homogeneous anechoic content and enhanced through transmission.",
            "Irregular hypoechoic mass with microlobulated margins and no posterior acoustic features.",
            "Complex lesion with solid and cystic components requiring separate segmentation boundaries.",
            "Oval mass with circumscribed margins and posterior acoustic enhancement with edge refraction.",
            "Hypoechoic lesion with irregular borders and extension to skin surface.",
            "Mass with mixed echogenicity and microcalcifications distributed throughout the lesion.",
            "Irregular hypoechoic mass with angular margins and surrounding architectural distortion.",
            "Complex cystic mass with thick wall and internal echoes requiring fluid-solid interface segmentation.",
            "Oval, parallel-oriented hypoechoic mass with circumscribed margins and subtle posterior enhancement.",
            "Mass with spiculated margins and marked posterior acoustic shadowing limiting deep margin assessment.",
            "Hypoechoic lesion with indistinct margins and heterogeneous internal architecture.",
            "Circumscribed mass with anechoic content and thin, well-defined anterior wall.",
            "Irregular hypoechoic mass with microlobulated contours and mild posterior shadowing.",
            "Complex lesion with both circumscribed and angular margin segments.",
            "Oval mass with indistinct margins and isoechoic texture blending with surrounding tissue.",
            "Hypoechoic lesion with irregular borders and posterior acoustic enhancement.",
            "Mass with spiculated margins and hyperechoic foci representing microcalcifications.",
            "Complex cystic structure with internal septations and debris-fluid level.",
            "Irregular hypoechoic mass with angular margins and no posterior acoustic features.",
            "Oval, parallel-oriented lesion with circumscribed margins and homogeneous hypoechoic texture.",
            "Mass with microlobulated margins and posterior acoustic shadowing.",
            "Hypoechoic lesion with indistinct borders and surrounding tissue edema.",
            "Circumscribed anechoic mass with thin capsule and enhanced through transmission.",
            "Irregular hypoechoic mass with spiculated margins and extension into fatty tissue.",
            "Complex lesion with both hypoechoic and hyperechoic regions requiring multi-threshold segmentation.",
            "Oval mass with circumscribed margins and posterior acoustic enhancement with refractive edge shadowing.",
            "Hypoechoic lesion with irregular contours and ductal extension pattern.",
            "Mass with angular margins and heterogeneous internal echotexture with cystic areas.",
            "Irregular hypoechoic mass with spiculated margins and marked posterior shadowing.",
            "Complex cystic structure with thick septations and solid components.",
            "Oval, parallel-oriented mass with indistinct margins and homogeneous hypoechoic texture.",
            "Hypoechoic lesion with microlobulated margins and mild posterior acoustic enhancement.",
            "Mass with circumscribed anterior margin but indistinct posterior boundary with shadowing."
        ],
        "style": [
            "High signal-to-noise ratio with excellent contrast between hypoechoic mass and surrounding parenchyma.",
            "Reverberation artifacts present in near field, partially obscuring anterior lesion margin.",
            "Posterior acoustic enhancement with clear through transmission behind cystic structure.",
            "Speckle noise pattern with reduced contrast resolution in deeper tissue planes.",
            "Anisotropy artifact causing variable echogenicity in fibrous structures.",
            "Side lobe artifacts creating false echoes adjacent to strongly reflective interfaces.",
            "Edge shadowing with refractive shadows along lateral margins of circumscribed mass.",
            "Acoustic shadowing with complete signal loss behind calcified structures.",
            "Mirror image artifact duplicating lesion appearance across fascial planes.",
            "Comet tail artifacts originating from microcalcifications within ductal structures.",
            "Low dynamic range compression emphasizing subtle contrast differences in parenchyma.",
            "Time-gain compensation optimally set with uniform brightness throughout depth.",
            "Over-gained image with saturation artifacts in near-field adipose tissue.",
            "Under-gained image with insufficient penetration to visualize deep lesion boundaries.",
            "Multipath artifacts creating duplicate echoes in complex cystic structures.",
            "Beam width artifacts causing partial volume averaging at lesion margins.",
            "Range ambiguity artifacts from high pulse repetition frequency settings.",
            "Post-processing edge enhancement emphasizing spiculated margins.",
            "Spatial compounding with reduced speckle noise and improved contrast resolution.",
            "Harmonic imaging with improved signal-to-noise ratio and reduced clutter artifacts.",
            "Spatial resolution degradation in far field due to transducer frequency limitations.",
            "Near-field clutter obscuring superficial lesion architecture.",
            "Posterior acoustic shadowing with clean shadow boundaries behind dense mass.",
            "Dirty shadowing with internal echoes and irregular posterior boundary.",
            "Enhanced through transmission with increased posterior echogenicity.",
            "Focal banding artifact from improper time-gain compensation settings.",
            "Ring-down artifacts originating from gas microbubbles in ductal systems.",
            "Acoustic enhancement with sharply defined posterior boundary behind simple cyst.",
            "Partial shadowing affecting only portion of lesion posterior aspect.",
            "Refraction artifacts creating duplicate or distorted lesion margins.",
            "Sector width artifacts with decreased lateral resolution at image periphery.",
            "Electronic noise manifesting as random bright pixels throughout image.",
            "Acoustic speckle pattern with granular texture in homogeneous tissues.",
            "Contrast resolution optimized for discrimination of subtle echogenicity differences.",
            "Post-processing grayscale mapping emphasizing mid-range echogenicities.",
            "Spatial resolution sufficient to visualize microcalcifications within mass.",
            "Depth penetration limitations causing signal dropout in posterior regions.",
            "Transducer frequency characteristics producing optimal axial resolution.",
            "Lateral resolution degradation in far field creating blurred margins.",
            "Slice thickness artifacts from finite elevation plane width.",
            "Motion artifacts creating blurred lesion boundaries from patient movement.",
            "Reverberation between parallel surfaces creating multiple equidistant lines.",
            "Acoustic shadowing with tapered configuration behind angular margins.",
            "Enhanced contrast between lesion and surrounding tissue from frequency compounding.",
            "Speckle reduction filtering creating smoothed texture in homogeneous regions.",
            "Dynamic range compression preserving detail in both near and far fields.",
            "Posterior enhancement with gradual fall-off in deeper tissues.",
            "Acoustic shadowing with sharp, well-defined margins behind calcifications.",
            "Near-field resolution optimized for superficial lesion characterization.",
            "Beam formation artifacts creating irregular margin appearance.",
            "Contrast resolution insufficient for discrimination of subtle internal echoes.",
            "Harmonic imaging reducing phase aberration artifacts in heterogeneous tissue.",
            "Spatial compounding reducing anisotropy and speckle noise.",
            "Time-gain compensation artifacts creating banding in mid-depth regions.",
            "Electronic interference creating horizontal banding across image.",
            "Acoustic noise from poor transducer contact degrading image quality.",
            "Post-processing windowing emphasizing high-contrast interfaces.",
            "Spatial resolution adequate for visualization of fine spiculations.",
            "Depth-dependent resolution degradation affecting far-field detail.",
            "Transducer footprint artifacts creating near-field distortion.",
            "Pulse repetition frequency optimized for depth without range ambiguity.",
            "Acoustic speckle pattern masking subtle internal architecture.",
            "Contrast enhancement emphasizing differences between lesion and parenchyma.",
            "Reverberation artifacts between transducer and skin surface.",
            "Posterior acoustic phenomena with mixed shadowing and enhancement.",
            "Beam steering artifacts in compound imaging creating margin distortion.",
            "Signal-to-noise ratio degradation in obese patients due to attenuation.",
            "Frequency-dependent attenuation affecting higher harmonics in deep tissue.",
            "Spatial resolution trade-off with penetration depth based on transducer frequency.",
            "Time-gain compensation curve creating uneven tissue representation.",
            "Acoustic shadowing with irregular margins behind heterogeneous mass.",
            "Posterior enhancement with comet-tail artifacts in cystic structures.",
            "Speckle pattern characteristic of specific transducer array design.",
            "Contrast resolution limitations in heterogeneous, dense parenchyma.",
            "Artifact reduction algorithms preserving true anatomical boundaries.",
            "Beam formation quality affecting lateral resolution and margin definition.",
            "Acoustic noise floor limiting detection of subtle hypoechoic regions.",
            "Post-processing dynamic range affecting tissue contrast visualization.",
            "Spatial compounding reducing shadowing and enhancement artifacts.",
            "Harmonic imaging improving boundary definition in cystic lesions."
        ]
    }
}