{
    "gemini": {
        "prostate": [
            "Well-defined, thin, low-signal prostatic capsule. Homogeneous high T2 signal peripheral zone (PZ). Clear demarcation from the heterogeneous, intermediate-signal transition zone (TZ).",
            "Intact, smooth prostatic capsule. Bright, homogeneous PZ. Small, well-circumscribed TZ, consistent with minimal BPH.",
            "Sharp posterior capsule with a visible periprostatic fat plane separating it from the rectum. Zonal anatomy is preserved.",
            "Clearly defined prostatic apex, tapering inferiorly, with a distinct low-signal boundary from the external urethral sphincter.",
            "Normal zonal anatomy: High T2 signal PZ, heterogeneous intermediate-signal TZ, and low-signal central zone (CZ) are all distinguishable.",
            "Prostatic base shows a sharp, smooth interface with the bladder wall. Seminal vesicles are T2 hyperintense and distinct.",
            "Prominent, dark T2 signal of the anterior fibromuscular stroma (AFMS), providing a clear anterior boundary for the TZ.",
            "Symmetric gland. Capsule is distinct and hypointense around the entire circumference. PZ is thick and uniformly T2 hyperintense.",
            "Minor BPH: Slightly enlarged TZ with small, well-defined mixed-signal nodules, but the PZ remains thick and brightly defined.",
            "Clear differentiation between the high signal PZ and the compressed, low-signal CZ surrounding the T2-hyperintense ejaculatory ducts.",
            "Markedly enlarged TZ due to BPH, compressing the PZ into a thin, peripheral crescent. Capsule remains intact but stretched.",
            "Globular gland contour from severe BPH. The TZ is heterogeneous with multiple mixed-signal adenomatous nodules, blurring the PZ/TZ interface.",
            "BPH nodules creating an irregular, 'lumpy-bumpy' outer contour, but the overlying thin hypointense capsule is still visible.",
            "Large median lobe BPH nodule protruding superiorly into the bladder base, creating a complex, convex boundary at the bladder neck.",
            "Confluent BPH nodules obscuring normal zonal anatomy. The boundary between the heterogeneous TZ and the compressed PZ is ill-defined.",
            "Heterogeneous TZ with cystic BPH changes (focal T2 hyperintensities) and low-signal stromal nodules, creating a complex internal matrix.",
            "The enlarged TZ effaces the central zone. The peripheral zone is severely thinned, heterogeneous, and focally indistinct.",
            "Massive globular BPH (>100cc). The capsule is thinned and difficult to distinguish from adjacent low-signal structures, especially anteriorly.",
            "Irregular interface between the AFMS and the anterior aspect of the hyperplastic TZ, with nodules indenting the AFMS.",
            "BPH nodules demonstrating 'charcoal-grey' intermediate T2 signal, blending imperceptibly with the compressed PZ.",
            "Asymmetric BPH, with the left TZ lobe significantly larger, distorting the urethra and midline, and effacing the left PZ.",
            "The compressed PZ is visible only as a thin, bright rim posteriorly and laterally; it is completely effaced anteriorly by BPH.",
            "BPH causing a rounded, blunted apex, making the inferior-most boundary with the sphincter indistinct.",
            "Stromal BPH: The TZ is diffusely hypointense, mimicking malignancy, and blurring the boundary with both the AFMS and the PZ.",
            "Glandular BPH: The TZ is heterogeneous with multiple T2 bright nodules, creating complex, high-contrast internal signal boundaries.",
            "Focal, ill-defined T2 hypointense lesion in the right posterior-lateral PZ, abutting the capsule over 1.0 cm.",
            "Lenticular T2 hypointense lesion in the left PZ, causing focal bulging and irregularity of the prostatic capsule.",
            "Diffuse T2 hypointensity throughout the entire PZ, obscuring zonal boundaries and making the capsule the only visible outer border.",
            "Ill-defined low T2 signal lesion at the right apex, blurring the capsule and the interface with the external urethral sphincter.",
            "T2 hypointense lesion in the PZ with broad capsular abutment (>1.5 cm), causing retraction of the overlying capsule.",
            "Frank extraprostatic extension (EPE): T2 hypointense tumor clearly breaches the low-signal capsule into the periprostatic fat.",
            "Focal irregular bulging of the posterior capsule overlying a T2 dark lesion, with loss of the normal thin hypointense line.",
            "Obliteration of the recto-prostatic angle on the left side by a T2 hypointense tumor, indicating definite EPE.",
            "T2 hypointense lesion extending from the PZ into the TZ, effacing the normal zonal boundary between them.",
            "Tumor involvement of the neurovascular bundle: T2 hypointense signal extends postero-laterally, enveloping the bundle and obscuring the capsule.",
            "Large anterior T2 hypointense tumor, inseparable from the AFMS, obliterating the anterior gland boundary.",
            "Seminal vesicle invasion: T2 hypointense signal extends from a tumor at the base into the proximal left seminal vesicle, effacing its high-signal.",
            "Bladder neck invasion: T2 hypointense tumor at the base obliterates the fat plane and extends into the T2-dark bladder muscle.",
            "Circumscribed, round, T2 hypointense lesion in the PZ, sharply defined but with an indistinct interface with the capsule.",
            "Spiculated T2 hypointense lesion in the PZ, indicating infiltrative margins, blurring the boundary with adjacent high-signal PZ.",
            "T2 hypointense tumor effacing the low-signal capsule, making the boundary indistinct from the adjacent rectal wall.",
            "Asymmetric capsular bulging at the left base, corresponding to an underlying T2 dark lesion, suspicious for EPE.",
            "A T2 hypointense lesion 'bridges' the PZ and TZ, making zonal segmentation impossible in that sector.",
            "Diffuse low T2 signal in the PZ, mimicking prostatitis, but with focal capsular retraction and irregularity posterolaterally.",
            "Multiple, discrete T2 hypointense foci throughout the PZ, complicating the definition of 'normal' PZ signal for boundary detection.",
            "Diffuse, bilateral low T2 signal throughout the PZ, consistent with acute prostatitis, obscuring the PZ-TZ boundary.",
            "Post-biopsy hemorrhage: Multiple T2 hypointense foci (hemosiderin) scattered in the PZ, masking underlying zonal signal and lesions.",
            "Asymmetric low T2 signal in the right PZ with associated capsular thickening and periprostatic T2-bright stranding (prostatitis).",
            "The PZ is heterogeneous with mixed low and high signal, lacking a dominant signal, blurring all internal and external boundaries.",
            "Linear T2 hypointense tracts (biopsy tracks) extending from the capsule into the PZ, one of which terminates in a T2-dark hematoma.",
            "Zonal anatomy is completely effaced by diffuse inflammatory change, rendering the gland a heterogeneous, intermediate-signal ovoid.",
            "Granulomatous prostatitis: Large, ill-defined T2 hypointense mass-like area replacing most of the PZ, mimicking an infiltrative tumor.",
            "Periprostatic inflammation blurring the capsular margin, especially anteriorly, blending it with adjacent fat signal.",
            "Prostatic abscess: A T2 hyperintense, peripherally-enhancing (on T2, a complex, high-signal) collection, distorting all zones.",
            "Post-biopsy hemorrhage creating a large T2-dark region at the apex, making the apical boundary completely indistinct.",
            "Multiple small signal voids (calcifications) along the surgical capsule (PZ-TZ boundary), creating a 'dotted line' interface.",
            "Large midline utricle cyst (T2 hyperintense) at the base, splaying the ejaculatory ducts and compressing the CZ.",
            "Ejaculatory duct cyst: T2 hyperintense, tubular structure within the low-signal CZ, adjacent to a normal seminal vesicle.",
            "Müllerian duct cyst: Midline T2 bright, pear-shaped cyst extending superiorly from the base, displacing the seminal vesicles.",
            "Multiple small retention cysts (T2 bright) within the enlarged TZ, adding to its heterogeneity and complicating internal segmentation.",
            "Large calcification (signal void) at the apex, causing susceptibility artifact that obscures the capsular boundary.",
            "Ductal ectasia: T2 bright, branching, tubular structures seen within the peripheral zone, not to be confused with cysts.",
            "Verumontanum hypertrophy, visible as a low-signal mound protruding into the central T2-bright urethra within the TZ.",
            "Asymmetric seminal vesicles: Left SV is T2 hyperintense and dilated; right SV is low signal and atrophic, indicating possible obstruction.",
            "Periprostatic venous plexus is prominent and T2 bright, complicating the segmentation of the postero-lateral capsular boundary.",
            "Post-TURP defect: T2 bright, fluid-filled cavity in the central/transition zone, with an irregular, low-signal internal border.",
            "Post-radiation: Diffuse, marked T2 hypointensity of the entire gland, especially the PZ. The capsule is often thickened and indistinct.",
            "Zonal anatomy is obliterated post-radiation; the gland appears as a homogeneous low-signal structure with blurred margins.",
            "Post-HIFU: Treated area in the right PZ shows marked T2 hypointensity and volume loss, with a sharp, irregular boundary with untreated tissue.",
            "Post-brachytherapy: Multiple signal-void artifacts from seeds, obscuring large portions of the gland, especially at the periphery.",
            "Seminal vesicle agenesis (bilateral), simplifying the prostatic base segmentation boundary, which is directly adjacent to the bladder.",
            "Ectopic ureter draining into the prostate, creating a T2-bright cystic structure near the base/ejaculatory duct junction.",
            "Small, atrophic prostate (<20cc). The PZ is very thin, and zonal differentiation is poor due to low gland volume.",
            "Prostatic hypoplasia: Gland is rudimentary, T2 signal is diffusely low, and boundaries are poorly defined.",
            "Massive gland volume (>150cc) due to BPH, causing significant image artifact and an indistinct capsule at the image periphery.",
            "Ill-defined apex: The T2 signal of the apical PZ blends imperceptibly with the intermediate signal of the urethral sphincter.",
            "Obliterated recto-prostatic fat plane: The posterior capsule is directly apposed to the rectal wall, boundary is a single thin hypointense line.",
            "Anterior indistinctness: The low signal of the AFMS is confluent with low-signal stromal BPH, erasing the anterior TZ boundary.",
            "Asymmetric BPH: Left TZ nodule bulges postero-laterally, effacing the PZ and creating a 'pseudo-lesion' that abuts the capsule.",
            "Confluent T2 hypointense lesions in the PZ and TZ (bridging lesion), with EPE, and post-biopsy hemorrhage, resulting in near-total loss of normal T2 signal and boundaries."
        ],
        "style": [
            "High signal-to-noise ratio (SNR) and high spatial resolution, providing sharp delineation of the hypointense prostatic capsule against hyperintense periprostatic fat.",
            "Low SNR, resulting in a grainy or noisy texture throughout the gland, particularly obscuring the PZ-TZ boundary.",
            "Severe motion artifacts in the phase-encoding direction, appearing as ghosting, which blurs the anterior prostatic margin and the AFMS.",
            "Marked susceptibility artifact from rectal gas, causing signal void and geometric distortion of the posterior peripheral zone and capsule.",
            "Endorectal coil acquisition: Characterized by extremely high SNR in the posterior gland (PZ) with significant signal intensity fall-off anteriorly towards the AFMS.",
            "Poor or failed fat saturation, resulting in high signal from periprostatic fat, which reduces the contrast and conspicuity of the capsular boundary.",
            "Low contrast-to-noise ratio (CNR) between the peripheral zone and transition zone, rendering zonal anatomy indistinct.",
            "Prominent chemical shift artifact at the prostate-fat interface, seen as a dark pixel band on one side and a bright band on the opposite side.",
            "Heavily T2-weighted sequence (long TE): Fluid in the bladder and seminal vesicles is exceptionally bright, enhancing contrast but increasing motion sensitivity.",
            "Visible aliasing (wrap-around) artifact, where structures from outside the FOV (e.g., pelvic sidewalls) are superimposed laterally.",
            "Typical 1.5T image quality: Moderate SNR, slightly less distinct zonal differentiation, and less pronounced susceptibility artifacts compared to 3T.",
            "Significant bias field artifact (intensity inhomogeneity), causing signal shading across the image, with one side of the prostate appearing darker than the other.",
            "Partial volume averaging due to thick slices (e.g., 5-6mm), resulting in blurred and indistinct margins at the prostatic apex and base.",
            "High spatial resolution (small voxels) but low SNR, creating a sharp yet noisy image where fine textures are obscured by grain.",
            "Non-uniform fat suppression, failing over the anterior abdominal wall and pubic bone marrow, leading to regional high signal artifacts.",
            "Pelvic phased-array coil acquisition: Good, uniform signal intensity and SNR across the entire prostate and surrounding pelvic structures.",
            "Signal void artifacts from metallic surgical clips (e.g., post-TURP or lymphadenectomy) obscuring the prostatic base and bladder neck.",
            "Peristaltic motion from the rectum causing blurring and distortion of the posterior capsule and neurovascular bundles.",
            "High-contrast 3T image: Hyperintense PZ, heterogeneous intermediate-signal TZ, and a clearly defined hypointense capsule.",
            "Washed-out appearance with low overall contrast, likely due to improper window/level settings or insufficient T2 weighting (short TE).",
            "Multiple punctate signal voids within the TZ and at the PZ-TZ interface, consistent with calcifications causing susceptibility artifacts.",
            "Pixelated appearance, indicative of a low-resolution acquisition matrix or excessive digital zoom.",
            "Complete failure of fat saturation: Periprostatic fat, subcutaneous fat, and bone marrow are all hyperintense, masking capsular margins.",
            "Image acquired with a mispositioned or partially inflated endorectal coil, leading to asymmetric signal intensity and distortion.",
            "Image plane is obliquely angulated, not a true axial, coronal, or sagittal view, complicating volumetric assessment.",
            "Severe B1 field inhomogeneity (dielectric effect) at 3T, causing a central signal drop-out within the transition zone.",
            "Motion artifact from bladder pulsatility creating phase ghosts superior to the prostate, overlapping the seminal vesicles.",
            "Minimally T2-weighted: Fluid signal is only moderately bright, and tissue contrast (PZ/TZ) is notably poor.",
            "Pronounced signal loss (T2 shortening) in the posterior PZ due to hemosiderin from recent biopsy, mimicking a tumor.",
            "Image corrupted by a linear 'zipper' artifact (k-space spike) running horizontally through the gland.",
            "Field of View (FOV) is too small (truncated), cutting off the lateral margins of the periprostatic fat and seminal vesicles.",
            "Field of View (FOV) is excessively large, leading to small prostate size on the image and reduced effective spatial resolution.",
            "High-quality 3T study: Uniform signal, excellent fat suppression, and crisp zonal boundaries, ideal for segmentation.",
            "Grainy, low-signal image, likely a 1.5T acquisition with insufficient signal averages (NEX/NSA) or a large patient.",
            "Prominent pulsatility artifacts from the iliac arteries, causing ghost replicas of the vessels across the image.",
            "Incomplete saturation of the periprostatic venous plexus, which appears bright and can be mistaken for or obscure EPE.",
            "Massive susceptibility artifact from a total hip prosthesis, creating a large signal void and severe distortion that obliterates the entire ipsilateral gland.",
            "Non-uniform signal intensity within the peripheral zone itself, likely a 'coil sensitivity' variation rather than true pathology.",
            "Over-smoothed image due to post-processing (e.g., noise reduction filter), resulting in a 'waxy' appearance and loss of fine texture.",
            "Image demonstrates a good trade-off between scan time and quality: minor graininess is present, but all critical boundaries are defined.",
            "Blooming susceptibility artifacts from numerous brachytherapy seeds, appearing as signal voids larger than the seeds themselves.",
            "Failed water suppression (e.g., in a fat-only sequence), resulting in an inverted-contrast appearance.",
            "Respiratory motion artifact causing blurring and indistinctness of the prostatic base and bladder neck interface.",
            "Severe aliasing from a small FOV in the phase-encode direction, wrapping the posterior buttocks anteriorly over the prostate.",
            "Image has a 'flat' dynamic range, with all tissues compressed into a narrow range of intermediate gray signals.",
            "High-resolution coronal T2: Sharp, high-contrast delineation of the prostatic apex and its interface with the hypointense external urethral sphincter.",
            "High-resolution sagittal T2: Clear visualization of the AFMS, bladder neck, and the retroprostatic fat plane.",
            "Image globally blurred due to gross patient movement during the acquisition, rendering all structures indistinct.",
            "Visible Gibbs (truncation) ringing artifacts, appearing as fine parallel lines near high-contrast edges like the bladder wall or capsule.",
            "Minimal artifacts, uniform signal, and excellent PZ-TZ contrast; a high-diagnostic-quality study.",
            "Diffuse signal hypointensity across the entire gland, characteristic of post-radiation fibrosis, reducing all internal contrast.",
            "Image quality compromised by severe ascites, which introduces motion, signal inhomogeneity, and dielectric effects.",
            "Moderate T2 weighting (TE ~80-100ms), providing a good balance between high SNR and sufficient T2 contrast.",
            "Image acquired using parallel imaging (e.g., SENSE, GRAPPA) with a high acceleration factor, leading to central SNR drop-off or noise enhancement.",
            "Geometric distortion (warping) at the peripheries of the field of view, causing the prostate to appear slightly ovoid or misshapen.",
            "Noisy' fat suppression: The signal from fat is not nulled to black but remains as a grainy, intermediate-gray signal.",
            "Excellent flow compensation, rendering blood vessels (venous plexus, iliacs) as dark, signal-void structures.",
            "Incomplete flow suppression, with hyperintense signal in pelvic vessels leading to pulsatility ghosting artifacts.",
            "High-resolution 3D T2 acquisition (e.g., CUBE, SPACE): Isotropic voxels provide sharp multiplanar reformats, but with slightly lower SNR than 2D.",
            "3D T2 acquisition with motion artifact, resulting in a 'stair-step' artifact on sagittal and coronal reformats.",
            "Image from an air-filled endorectal coil, causing a large susceptibility artifact and signal void at the posterior gland boundary.",
            "Low-field (e.g., 0.5T or 1.0T) acquisition: Characterized by fundamentally low SNR, poor resolution, and long scan times.",
            "Poor shimming, resulting in non-uniform signal and failed, patchy fat saturation across the field of view.",
            "Signal-void artifacts from metallic sutures in the post-prostatectomy bed, obscuring assessment of the anastomosis.",
            "Chemical shift artifact (Type 2) causing blurring and signal loss at zonal boundaries due to intravoxel dephasing.",
            "High-bandwidth acquisition: Minimizes chemical shift and susceptibility artifacts but at the cost of reduced SNR.",
            "Low-bandwidth acquisition: Maximizes SNR and contrast but is highly sensitive to motion, chemical shift, and susceptibility artifacts.",
            "Image windowed too brightly (high window center/width), saturating the high-signal PZ and seminal vesicles, obscuring internal detail.",
            "Image windowed too darkly (low window center/width), making the hypointense capsule and AFMS indistinguishable from signal void.",
            "Strong dielectric shading at 3T in a large patient, causing a 'dark' band across the center of the abdomen, affecting the prostate.",
            "T2-weighted turbo spin-echo (TSE) sequence with a long echo train length, causing perceptible blurring of edges and T2 decay effects.",
            "Single-shot fast spin-echo (ssFSE) acquisition: Inherently low resolution and blurred, 'smeared' appearance, but very fast and motion-robust.",
            "Image quality degraded by an improperly placed anterior surface coil, leading to poor signal in the anterior gland.",
            "Posterior signal drop-off in a 1.5T exam using only an anterior phased-array coil, compromising PZ visualization.",
            "Cross-talk artifact: Faint lines visible at the intersection of slice groups in an interleaved acquisition.",
            "Data clipping artifact: Regions of extremely high signal (e.g., urine) appear 'flat' white with a surrounding dark halo.",
            "Scan acquired with anti-peristaltic agent (e.g., Glucagon): Rectal wall is sharp and motion-free, improving posterior margin assessment.",
            "Scan acquired without anti-peristaltic agent: Significant blurring and ghosting from the rectum, obscuring the posterior capsule.",
            "High-resolution, small FOV 'zoom' scan of the prostate: Excellent detail but potential for aliasing if outer suppression bands fail.",
            "Vibration artifact (e.g., from gradient knocking or cooling system), causing fine, 'wavy' lines or 'herringbone' patterns across the image."
        ]
    },
    "GPT5": {
        "prostate": [
            "Prostate gland with well-defined capsule and homogeneous intermediate T2 signal in the peripheral zone, mild hyperintensity of transition zone with smooth lobulated contour.",
            "Peripheral zone shows diffuse mild hypointensity relative to skeletal muscle with intact capsule and homogeneous transition zone signal.",
            "Prostate demonstrating asymmetric enlargement of the right transition zone with heterogeneous T2 signal intensity and compressed peripheral zone.",
            "Homogeneous hyperintense peripheral zone with discrete low-signal-intensity nodules in the transition zone consistent with benign prostatic hyperplasia.",
            "Peripheral zone exhibits focal wedge-shaped T2 hypointensity along the left posterolateral aspect, capsular margin preserved.",
            "Diffusely heterogeneous T2 signal within transition zone, irregular nodular hyperplasia causing median lobe protrusion into bladder base.",
            "Prostate gland with sharply demarcated low-signal-intensity capsule surrounding homogeneous intermediate-signal parenchyma.",
            "Asymmetric peripheral zone thinning on the right side with diffuse T2 hypointensity and preserved capsule integrity.",
            "Peripheral zone demonstrates heterogeneous high T2 signal with scattered punctate hypointense foci representing glandular atrophy.",
            "Transition zone shows multiple circumscribed round low-signal-intensity nodules with surrounding stromal hyperintensity.",
            "Well-defined prostate boundaries with mildly irregular anterior fibromuscular stroma exhibiting low T2 signal intensity.",
            "Peripheral zone hyperintense and sharply demarcated from the hypointense capsule and central gland structures.",
            "Prostate capsule intact with symmetric peripheral zone exhibiting homogeneously high T2 signal and discrete central gland demarcation.",
            "Bilateral diffuse T2 hypointensity in peripheral zones, loss of normal zonal differentiation between transition and peripheral zones.",
            "Prominent median lobe protruding into bladder base with mixed T2 signal in the transition zone and preserved peripheral signal.",
            "Peripheral zone demonstrates asymmetric low T2 signal in the left posterior aspect with focal contour bulge abutting the capsule.",
            "Transition zone enlarged with heterogeneous nodularity and intermixed areas of low and high T2 signal intensities.",
            "Prostate gland of normal volume with smooth capsule, distinct high-signal peripheral rim, and symmetric central gland morphology.",
            "Peripheral zone exhibits patchy low T2 signal intensity without contour irregularity or extracapsular extension.",
            "Diffuse stromal hyperplasia within the transition zone causing central gland enlargement and compression of peripheral tissue.",
            "Homogeneous hyperintense peripheral zone with faint linear low-signal septations corresponding to fibromuscular strands.",
            "Transition zone demonstrates encapsulated nodules with central hyperintense cores and peripheral hypointense rims.",
            "Peripheral zone hypointense on the right posterior aspect with subtle capsular bulging and obliteration of rectoprostatic fat plane.",
            "Prostate capsule continuous and smooth, internal parenchyma displaying preserved zonal anatomy and symmetric signal distribution.",
            "Heterogeneous T2 signal within the transition zone with indistinct border between transition and peripheral zones.",
            "Peripheral zone with symmetric high T2 signal, well-demarcated from low-signal-intensity fibromuscular stroma anteriorly.",
            "Prostate shows diffuse low T2 signal intensity in peripheral zone with irregular margins and loss of capsule definition posteriorly.",
            "Central gland enlarged, multinodular with mixed T2 intensity, compressing peripheral zone into thin peripheral rim.",
            "Peripheral zone high T2 signal intensity sharply confined by continuous hypointense capsule.",
            "Peripheral zone exhibits patchy hypointense foci bilaterally without distortion of capsule or adjacent structures.",
            "Transition zone mildly enlarged, discrete round nodules showing mixed stromal and glandular T2 patterns.",
            "Peripheral zone with uniform hyperintensity, smooth capsule, and clear boundary between zones.",
            "Diffuse T2 hypointensity across both zones, capsule intact, no focal bulge or extracapsular extension evident.",
            "Peripheral zone demonstrates localized asymmetric wedge-shaped low T2 signal with subtle capsular irregularity.",
            "Prostate capsule sharply hypointense, outlining gland with high contrast against surrounding periprostatic fat.",
            "Central gland enlargement due to multiple well-encapsulated nodules, each with low T2 signal rims and hyperintense centers.",
            "Peripheral zone hyperintense with focal linear hypointense striations corresponding to fibrotic septa.",
            "Prostate with compressed peripheral zone showing decreased T2 signal and mild contour distortion from central hypertrophy.",
            "Peripheral zone bilateral high T2 signal intensity, sharply bordered by hypointense capsule and central gland.",
            "Peripheral zone irregularly hypointense in the right posterolateral region, indistinct interface with capsule.",
            "Prostate capsule smooth and intact, internal zonal differentiation preserved with homogeneous transition zone.",
            "Central gland hyperplastic, mildly lobulated contour, and heterogeneous T2 signal with peripheral sparing.",
            "Peripheral zone low T2 signal intensity posteriorly with partial obliteration of rectoprostatic angle.",
            "Transition zone demonstrating dominant low-signal-intensity nodules causing asymmetric protrusion into the bladder neck.",
            "Peripheral zone homogeneous high signal intensity without nodularity or capsular irregularity.",
            "Prostate demonstrates concentric hypertrophy of transition zone, compressing hyperintense peripheral rim.",
            "Peripheral zone asymmetric hypointensity with capsular bulging, discrete from high-signal contralateral side.",
            "Transition zone large, heterogeneous, containing well-circumscribed nodules with mixed signal intensity.",
            "Peripheral zone bilaterally symmetric high T2 signal, smooth capsular contour, and visible neurovascular bundles.",
            "Prostate capsule continuous, mild anterior fibromuscular thickening with uniformly low T2 signal.",
            "Peripheral zone markedly hypointense bilaterally, indistinct zonal interface, capsule preserved.",
            "Central gland hyperintense with scattered hypointense foci, mild peripheral compression.",
            "Peripheral zone demonstrates fine reticular hypointense striations in otherwise homogeneous high T2 background.",
            "Prostate capsule thickened but intact, peripheral zone heterogeneous with diffuse mild T2 hypointensity.",
            "Transition zone moderately enlarged, with encapsulated nodules exhibiting low peripheral and high central signal.",
            "Peripheral zone posterior aspect irregularly hypointense with minimal capsular protrusion.",
            "Prostate gland of small volume, homogeneous T2 signal, and sharply delineated capsule.",
            "Peripheral zone thin symmetric high-signal rim surrounding heterogeneous central gland mass.",
            "Peripheral zone diffusely hypointense with poorly defined border against periprostatic fat.",
            "Transition zone shows coalescent low-signal nodules merging into a heterogeneous central mass.",
            "Peripheral zone high T2 signal sharply differentiated from the hypointense anterior fibromuscular stroma.",
            "Prostate capsule continuous and well delineated with uniform internal parenchymal signal.",
            "Peripheral zone shows scattered punctate hypointense foci with smooth outer capsule.",
            "Transition zone asymmetric enlargement with nodular low-signal areas compressing urethral segment.",
            "Peripheral zone demonstrates focal linear low-signal band extending from capsule toward central gland.",
            "Prostate capsule intact, mild posterior contour irregularity due to adjacent seminal vesicle impression.",
            "Peripheral zone homogeneously high signal intensity with discrete low-signal subcapsular rim.",
            "Central gland moderately enlarged, irregular internal signal but well-demarcated boundary with peripheral tissue.",
            "Peripheral zone with bilateral symmetric hyperintensity, smooth capsule, and clear stromal interface.",
            "Prostate capsule irregularly thickened, peripheral zone heterogeneous low signal intensity bilaterally.",
            "Peripheral zone patchy low T2 signal without significant contour deformation or capsular disruption.",
            "Transition zone demonstrates diffuse stromal hyperplasia producing mottled T2 appearance.",
            "Peripheral zone intact high-signal rim with compressed central gland due to median lobe hypertrophy.",
            "Prostate small with homogeneous intermediate T2 signal and continuous hypointense capsule.",
            "Peripheral zone demonstrates discrete low-signal-intensity nodule along left posterolateral margin.",
            "Transition zone large, well-encapsulated nodules with alternating high and low T2 intensities.",
            "Peripheral zone hyperintense, smooth capsule, no signs of extracapsular extension or seminal vesicle invasion.",
            "Peripheral zone bilateral mild low T2 signal without focal lesion, preserved periprostatic fat plane.",
            "Prostate capsule continuous and sharply hypointense, enclosing symmetric high-signal parenchyma.",
            "Peripheral zone right-sided asymmetric low T2 signal with subtle focal bulge and partial loss of capsule definition."
        ],
        "style": [
            "High signal-to-noise ratio T2-weighted image with uniform fat suppression and minimal motion artifacts, showing excellent delineation of the prostate capsule.",
            "T2-weighted axial acquisition with mild Gibbs ringing along the capsule margin, moderate SNR, and preserved zonal contrast.",
            "T2-weighted image with subtle susceptibility artifacts from rectal gas, slightly reducing posterior peripheral zone visibility.",
            "T2-weighted image demonstrating mild phase-encoding ghosting due to patient motion, otherwise good contrast between zones.",
            "Low signal-to-noise T2-weighted image with granular noise texture and reduced delineation of transition zone nodularity.",
            "High-resolution T2-weighted image with thin slices and high SNR, clearly distinguishing the hypointense capsule and hyperintense peripheral zone.",
            "Moderate SNR image with slight blurring secondary to incomplete fat suppression, peripheral zone contrast partially reduced.",
            "Axial T2-weighted sequence with mild wrap-around artifact along the anterior rectal wall, gland margins still discernible.",
            "T2-weighted image acquired with turbo spin echo technique, high SNR, minor blurring from long echo train length.",
            "Low SNR image with coarse background noise and faint ghosting in phase-encoding direction, diminished capsular definition.",
            "High-contrast T2-weighted image with excellent spatial resolution and uniform signal across prostate parenchyma.",
            "Image demonstrates mild chemical shift artifact along the prostate–periprostatic fat interface, minimal diagnostic interference.",
            "T2-weighted image with slightly uneven B1 field causing regional signal inhomogeneity in the peripheral zone.",
            "T2-weighted fast spin-echo image with moderate motion artifact from respiration, peripheral rim blurred.",
            "Image characterized by excellent SNR, sharp capsular boundary, and minimal motion-induced distortion.",
            "T2-weighted image with low contrast-to-noise ratio between peripheral and transition zones due to insufficient TE optimization.",
            "Axial T2-weighted image demonstrating magnetic susceptibility distortion near air-tissue interface posteriorly.",
            "High SNR image with strong peripheral-to-transition zone contrast, minor Gibbs ringing along gland boundaries.",
            "T2-weighted image with motion-induced phase ghosts anterior to the prostate, mild reduction in clarity.",
            "Moderate noise image with adequate spatial resolution and visible partial volume effects at the apex.",
            "High-quality T2-weighted image with uniform signal, sharp delineation of capsule, and excellent zonal contrast.",
            "T2-weighted image showing nonuniform coil sensitivity, causing mild anterior signal drop-off.",
            "Low SNR image with salt-and-pepper noise texture, loss of fine detail in peripheral gland structures.",
            "High spatial resolution T2-weighted acquisition with slight aliasing artifact along anterior pelvic wall.",
            "T2-weighted image with visible pulsation artifact from iliac vessels encroaching on peripheral zone signal.",
            "Moderate-resolution image with adequate SNR but partial volume averaging at prostate–seminal vesicle junction.",
            "T2-weighted image showing excellent gray-scale dynamic range with subtle hypointense fibromuscular stroma differentiation.",
            "Image acquired with endorectal coil providing superior SNR and detailed capsular definition but minor field inhomogeneity.",
            "Low-SNR image with distinct granular noise pattern and poor zonal differentiation between central and peripheral regions.",
            "High-contrast image with slight distortion due to magnetic field nonuniformity near posterior capsule.",
            "Moderate SNR image showing ghosting artifact secondary to rectal peristalsis, gland margins partially obscured.",
            "T2-weighted fast spin echo image with high SNR, slight blurring from long echo spacing, and smooth signal transition.",
            "Low SNR acquisition exhibiting random noise spikes and reduced visibility of anterior fibromuscular stroma.",
            "Image with mild B0 inhomogeneity across the field-of-view, creating anterior-to-posterior signal gradient.",
            "High-quality T2-weighted image with minimal susceptibility distortion and excellent zonal demarcation.",
            "Moderate-resolution image with clear edge enhancement from mild Gibbs phenomenon around the prostate capsule.",
            "T2-weighted image displaying uniform signal distribution, minimal phase wrap, and consistent brightness across zones.",
            "Image affected by minor truncation artifact at capsule border, otherwise high SNR and strong peripheral signal.",
            "Low SNR T2-weighted scan with pronounced mottled noise and limited zonal contrast discrimination.",
            "High SNR image obtained using multi-channel surface coils, displaying superior peripheral zone clarity.",
            "T2-weighted image with mild aliasing artifact from undersampling, gland margins partially wrapped into FOV.",
            "High-contrast image with sharp capsular delineation and strong peripheral zone hyperintensity.",
            "Moderate SNR image affected by slight motion blur, peripheral capsule appears softened.",
            "Low-SNR image with poor gray-scale contrast, capsule barely perceptible against background signal.",
            "High SNR image demonstrating excellent anatomic resolution, minimal geometric distortion, and smooth texture.",
            "T2-weighted image with faint chemical shift banding between periprostatic fat and gland surface.",
            "Moderate SNR image with consistent intensity profile but mild banding artifact anteriorly.",
            "High SNR fast spin echo image with excellent zonal differentiation and visible internal ductal structures.",
            "Low SNR image exhibiting random speckle noise and reduced signal uniformity across axial slices.",
            "T2-weighted image with ghosting from cardiac motion, mild anterior streaking observed.",
            "High-quality image with sharp delineation of urethral lumen and minimal partial volume averaging.",
            "Moderate SNR image with visible ringing artifact near high-contrast interfaces, otherwise preserved definition.",
            "Low-contrast T2-weighted image due to suboptimal echo time, zones not clearly differentiated.",
            "T2-weighted image with excellent SNR, clear capsule definition, and minimal noise floor elevation.",
            "Image showing local field inhomogeneity near rectal wall, causing subtle posterior signal drop.",
            "High-resolution acquisition with faint truncation lines near lateral margins of the capsule.",
            "T2-weighted image with mild distortion from eddy currents, signal integrity largely preserved.",
            "Low SNR image with coarse noise pattern and reduced peripheral-to-transition zone contrast.",
            "High-quality image with smooth gradient intensity transitions and consistent fat suppression.",
            "T2-weighted scan showing slight motion ghosting from bowel peristalsis, gland boundary partially blurred.",
            "Moderate SNR image with asymmetric signal fall-off due to coil sensitivity variation.",
            "High-resolution image demonstrating uniform T2 contrast and clear internal nodular definition.",
            "Low SNR acquisition with mottled appearance and visible phase-encoding streak artifacts.",
            "T2-weighted image showing faint Gibbs ringing along rectoprostatic interface, high overall SNR.",
            "Moderate SNR image with clear gray-scale separation and minimal geometric distortion.",
            "High-quality image with excellent contrast-to-noise ratio, capsule clearly hypointense.",
            "Low-contrast image with diffuse noise distribution and indistinct zonal boundary.",
            "High SNR image demonstrating distinct delineation of anterior fibromuscular stroma and capsule.",
            "T2-weighted image with mild aliasing artifact across the superior gland region.",
            "Moderate SNR scan showing uniform intensity but slight peripheral blurring due to motion.",
            "Low SNR image with high-frequency noise, causing grainy peripheral zone texture.",
            "T2-weighted image with subtle motion-induced ghosting posteriorly and mild signal fall-off.",
            "High-contrast acquisition with clear hyperintense peripheral zone and hypointense capsule line.",
            "Low SNR image with evident coil dropout artifact anteriorly, peripheral zone barely visible.",
            "Moderate SNR T2-weighted scan with uniform gray-scale distribution and minor phase shift artifact.",
            "High-quality image with sharp structural delineation, minimal distortion, and optimal echo parameters.",
            "T2-weighted fast spin-echo image with moderate blurring, capsule margins slightly indistinct.",
            "Low SNR image with visible random speckle noise and decreased peripheral detail.",
            "High-resolution T2-weighted scan showing strong peripheral brightness and intact capsular hypointensity.",
            "Moderate SNR image with slight ghosting due to patient motion, gland still clearly visible."
        ]
    },
    "DeepSeek": {
        "prostate": [
            "Homogeneous hyperintense peripheral zone with well-defined hypointense capsule. Transition zone demonstrates mild heterogeneous signal with few small BPH nodules.",
            "Markedly heterogeneous transition zone with numerous mixed-signal BPH nodules creating lobulated architecture. Peripheral zone maintains uniform hyperintensity.",
            "Circumferential hypointense surgical capsule clearly demarcating transition zone from peripheral zone. Peripheral zone shows diffuse T2 hypointensity suggesting prostatitis.",
            "Asymmetric transition zone enlargement with dominant hypointense BPH nodule in left anterior region. Capsular definition remains intact bilaterally.",
            "Diffuse T2 hypointensity throughout peripheral zone with maintained zonal anatomy. Capsular margin shows focal bulging posterolaterally on right.",
            "Well-defined T2 hypointense focus in left peripheral zone at apex, measuring 1.2 cm, with maintained capsular integrity.",
            "Heterogeneous transition zone with 'organized chaos' pattern of mixed BPH nodules. Anterior fibromuscular stroma appears thickened and hypointense.",
            "Global gland enlargement with preserved zonal anatomy. Peripheral zone shows patchy T2 hyperintensity with cystic changes.",
            "Focal capsular irregularity at mid-gland posteriorly with adjacent T2 hypointense lesion extending to neurovascular bundle.",
            "Central zone appears as symmetric hypointense triangular structure at gland base. Peripheral zone demonstrates uniform T2 hyperintensity.",
            "Extensive BPH changes with numerous T2 hyperintense cystic nodules within transition zone. Surgical capsule appears thickened and hypointense.",
            "Diffuse T2 hypointensity effacing normal zonal anatomy. Capsular margin remains distinct though slightly irregular.",
            "Anterior fibromuscular stroma markedly hypointense and thickened. Peripheral zone shows focal T2 hypointense area in right mid-gland.",
            "BPH-dominated transition zone with 'streamer' pattern extending toward verumontanum. Peripheral zone maintains normal T2 hyperintensity.",
            "Focal T2 hypointense lesion at right base with extracapsular extension evidenced by neurovascular bundle encasement.",
            "Uniformly hypointense peripheral zone with loss of normal architecture. Transition zone shows early BPH changes with microcystic formation.",
            "Well-demarcated T2 hyperintense cystic nodule in transition zone measuring 0.8 cm. Peripheral zone shows mild diffuse T2 hypointensity.",
            "Asymmetric transition zone enlargement with dominant anterior component. Surgical capsule appears interrupted in several locations.",
            "Diffuse T2 hypointensity throughout gland with complete effacement of zonal boundaries. Capsular definition remains intact.",
            "Peripheral zone shows wedge-shaped T2 hypointense area extending from capsule to urethra, suggesting prostatitis.",
            "Marked BPH changes with mixed solid and cystic nodules. Peripheral zone demonstrates focal T2 hypointense nodule at left apex.",
            "Circumferential capsular thickening with maintained integrity. Peripheral zone shows heterogeneous T2 signal with areas of hypointensity.",
            "Transition zone demonstrates 'cloud-like' BPH nodules with heterogeneous signal. Anterior fibromuscular stroma appears atrophic.",
            "Focal T2 hypointense lesion in anterior transition zone with capsular deformity but no definite breach.",
            "Peripheral zone shows diffuse T2 hypointensity with several discrete hypointense nodules. Capsular margin remains sharp.",
            "Central zone hypertrophy with symmetric T2 hypointense expansion at base. Peripheral zone maintains normal architecture.",
            "Extensive cystic degeneration in transition zone with multiple T2 hyperintense cysts. Surgical capsule appears thin but intact.",
            "Focal capsular retraction adjacent to T2 hypointense lesion in left peripheral zone at mid-gland level.",
            "Diffuse glandular enlargement with homogeneous T2 hypointensity throughout both peripheral and transition zones.",
            "Well-defined T2 hypointense surgical capsule separating heterogeneous transition zone from uniformly hyperintense peripheral zone.",
            "Asymmetric peripheral zone T2 hypointensity, more pronounced on right side with maintained capsular integrity.",
            "Transition zone shows 'sponge-like' architecture with numerous small T2 hyperintense cystic spaces. Peripheral zone appears normal.",
            "Focal T2 hypointense area in anterior fibromuscular stroma with overlying capsular thickening.",
            "Peripheral zone demonstrates linear T2 hypointense bands radiating from capsule toward urethra, suggesting post-inflammatory changes.",
            "Marked transition zone enlargement with predominantly solid hypointense BPH nodules. Capsular definition remains sharp.",
            "Diffuse T2 hypointensity in peripheral zone with focal areas of signal void suggesting calcifications.",
            "Central zone appears prominent and hypointense, blending with transition zone. Peripheral zone shows patchy T2 hyperintensity.",
            "Focal capsular bulge with adjacent T2 hypointense mass in right peripheral zone at base level.",
            "Heterogeneous transition zone with 'swiss cheese' pattern of cystic and solid BPH nodules. Surgical capsule appears well-defined.",
            "Peripheral zone shows multifocal T2 hypointense lesions with maintained capsular integrity and zonal anatomy.",
            "Global gland enlargement with predominant transition zone hypertrophy. Peripheral zone compressed but maintains T2 hyperintensity.",
            "Focal T2 hypointense lesion at verumontanum level with extension into both peripheral and transition zones.",
            "Diffuse capsular thickening with maintained integrity. Peripheral zone shows homogeneous T2 hypointensity throughout.",
            "Transition zone demonstrates predominantly T2 hyperintense cystic BPH changes. Peripheral zone appears unremarkable.",
            "Asymmetric peripheral zone T2 hypointensity with focal capsular irregularity on left side at mid-gland.",
            "Central zone appears atrophic with maintained hypointensity. Peripheral zone shows diffuse T2 hypointensity with focal hyperintense areas.",
            "Marked BPH changes with 'grape cluster' pattern of nodules in transition zone. Surgical capsule appears thickened.",
            "Focal T2 hypointense lesion in anterior transition zone with capsular abutment but no definite invasion.",
            "Peripheral zone shows diffuse T2 hypointensity with loss of normal architecture but maintained capsular definition.",
            "Transition zone enlargement with mixed solid and cystic components. Peripheral zone demonstrates focal T2 hypointense area at right base.",
            "Circumferential capsular hypointensity with focal interruption posteriorly adjacent to T2 hypointense lesion.",
            "Diffuse glandular T2 hypointensity with complete loss of zonal differentiation. Capsular margin remains distinct.",
            "Peripheral zone shows multifocal T2 hypointense nodules with intervening areas of normal T2 hyperintensity.",
            "Transition zone demonstrates 'honeycomb' pattern of BPH nodules with heterogeneous signal. Surgical capsule appears thin.",
            "Focal T2 hypointense lesion in left peripheral zone with capsular retraction and neurovascular bundle involvement.",
            "Asymmetric transition zone enlargement with dominant hypointense nodule on right side. Peripheral zone appears normal.",
            "Diffuse peripheral zone T2 hypointensity with focal areas of capsular thickening but no definite breach.",
            "Central zone appears prominent and hypointense, merging with transition zone. Peripheral zone shows uniform T2 hyperintensity.",
            "Marked BPH changes with predominantly solid hypointense nodules. Peripheral zone compressed but maintains normal signal.",
            "Focal T2 hypointense area in anterior fibromuscular stroma with overlying capsular preservation.",
            "Peripheral zone shows linear T2 hypointense strands suggesting post-inflammatory changes. Capsular margin remains sharp.",
            "Transition zone enlargement with 'mixed bag' pattern of BPH nodules. Surgical capsule appears well-defined and hypointense.",
            "Focal capsular irregularity adjacent to T2 hypointense lesion in right peripheral zone at apex level.",
            "Diffuse glandular T2 hypointensity with maintained zonal anatomy. Capsular definition remains intact throughout.",
            "Peripheral zone demonstrates wedge-shaped T2 hypointense area with base at capsule, suggesting prostatitis.",
            "Transition zone shows predominantly cystic BPH changes with T2 hyperintense nodules. Peripheral zone appears unremarkable.",
            "Asymmetric peripheral zone T2 hypointensity with focal capsular thickening on left side at mid-gland.",
            "Central zone hypertrophy with symmetric T2 hypointense expansion. Peripheral zone shows patchy T2 hypointensity.",
            "Marked BPH changes with 'organized chaos' pattern in transition zone. Surgical capsule appears interrupted in several areas.",
            "Focal T2 hypointense lesion in anterior transition zone with capsular deformity but maintained integrity.",
            "Peripheral zone shows diffuse T2 hypointensity with complete loss of normal architecture. Capsular margin remains sharp.",
            "Transition zone enlargement with mixed signal BPH nodules. Peripheral zone demonstrates focal T2 hypointense area at left base.",
            "Circumferential capsular hypointensity with focal bulge anteriorly adjacent to T2 hypointense lesion.",
            "Diffuse glandular T2 hypointensity with effacement of zonal boundaries. Capsular definition remains intact.",
            "Peripheral zone shows multifocal T2 hypointense nodules with maintained capsular integrity and zonal anatomy.",
            "Transition zone demonstrates 'sponge-like' architecture with numerous small T2 hyperintense cysts. Surgical capsule appears thickened.",
            "Focal T2 hypointense lesion in left peripheral zone with capsular retraction and adjacent neurovascular bundle thickening.",
            "Asymmetric transition zone enlargement with dominant anterior component. Peripheral zone shows diffuse T2 hypointensity.",
            "Diffuse peripheral zone T2 hypointensity with focal areas of signal void suggesting calcifications. Capsular margin remains sharp.",
            "Central zone appears prominent and hypointense, blending with transition zone. Peripheral zone shows uniform T2 hyperintensity."
        ],
        "style": [
            "High signal-to-noise ratio with excellent soft tissue contrast between peripheral zone and transition zone.",
            "Moderate motion artifact causing blurring along the phase-encoding direction, reducing zonal boundary definition.",
            "Gibbs ringing artifacts at tissue interfaces creating alternating bright and dark lines along the capsule.",
            "Excellent contrast-to-noise ratio with clear differentiation between BPH nodules and normal transition zone tissue.",
            "Susceptibility artifacts from post-biopsy hemorrhage causing focal signal voids in the peripheral zone.",
            "Wrap-around artifact in the phase-encoding direction with anatomical structures appearing duplicated.",
            "High spatial resolution acquisition with minimal partial volume averaging and sharp capsular definition.",
            "Radiofrequency inhomogeneity causing regional variations in signal intensity across the gland.",
            "Parallel imaging artifacts manifesting as noise-like patterns in the phase-encoding direction.",
            "Optimal TR/TE parameters providing excellent T2 weighting with fluid appearing bright and fibrous tissue dark.",
            "Chemical shift artifact of the second kind creating black boundaries at fat-water interfaces.",
            "Flow-related artifacts from adjacent vessels causing pulsation ghosts in the phase-encoding direction.",
            "High bandwidth acquisition reducing chemical shift artifacts but with decreased signal-to-noise ratio.",
            "Truncation artifacts creating alternating bands of high and low signal at sharp tissue boundaries.",
            "Excellent dynamic range with preserved signal intensity differences between various tissue types.",
            "Zipper artifacts from RF interference creating linear artifacts across the image.",
            "3D acquisition with isotropic voxels allowing multi-planar reconstruction without resolution loss.",
            "Metal artifacts from hip prostheses causing extensive signal dropout and geometric distortion.",
            "Partial Fourier acquisition reducing scan time but introducing phase cancellation artifacts.",
            "Radial k-space sampling producing streak artifacts from high-contrast structures.",
            "Optimal echo train length maintaining good signal intensity while minimizing blurring.",
            "Magnet inhomogeneity causing regional variations in T2 weighting across the field of view.",
            "Parallel imaging with acceleration factor 2 introducing minimal noise amplification.",
            "Motion degradation from rectal peristalsis obscuring the prostate-rectal interface.",
            "Excellent magnetic field homogeneity providing uniform fat suppression throughout the FOV.",
            "Cross-excitation artifacts from imperfect slice profiles causing signal reduction.",
            "Variable flip angle evolution in 3D TSE providing consistent signal throughout echo train.",
            "Susceptibility-induced geometric distortion near air-tissue interfaces in rectum.",
            "High receiver bandwidth minimizing chemical shift artifact but with increased noise.",
            "Phase oversampling preventing wrap-around artifact in the phase-encoding direction.",
            "Optimal fat suppression using spectral adiabatic inversion recovery providing uniform fat nulling.",
            "Respiratory motion artifacts creating ghosting in the phase-encoding direction.",
            "Multi-channel phased-array coil providing excellent signal-to-noise ratio with uniform sensitivity.",
            "Dielectric effects causing central brightness artifact at 3T field strength.",
            "Magnetization transfer effects reducing signal from macromolecule-rich tissues.",
            "CS reconstruction artifacts from high acceleration factors creating textured noise patterns.",
            "Excellent B0 field homogeneity with minimal geometric distortion throughout prostate.",
            "Flow compensation gradients reducing pulsatility artifacts from adjacent vessels.",
            "Variable bandwidth in frequency-encoding direction optimizing SNR and chemical shift.",
            "Radial k-space undersampling creating streak artifacts through the gland.",
            "Optimal NEX/averaging providing excellent SNR with acceptable acquisition time.",
            "Motion-robust acquisition with PROPELLER technique reducing motion artifacts.",
            "Susceptibility-weighted imaging creating exaggerated contrast at tissue interfaces.",
            "Compressed sensing reconstruction allowing reduced acquisition time with minimal artifact.",
            "B1 inhomogeneity causing uneven excitation and signal variation across prostate.",
            "High-resolution acquisition with small voxel size reducing partial volume effects.",
            "Parallel imaging with GRAPPA reconstruction showing minor residual aliasing.",
            "Magnet drift causing gradual phase errors and image blurring.",
            "Optimal echo spacing minimizing blurring in turbo spin echo acquisition.",
            "Chemical shift selective saturation providing effective but incomplete fat suppression.",
            "Motion-triggered acquisition reducing artifacts from rectal and patient motion.",
            "Susceptibility artifact from calcifications creating focal signal voids.",
            "Variable flip angle design in 3D TSE providing uniform T2 contrast.",
            "Partial k-space acquisition in phase direction reducing scan time with minimal resolution loss.",
            "Dielectric pads improving B1 homogeneity and signal uniformity at 3T.",
            "Flow-related enhancement in vessels creating bright signal within vascular structures.",
            "Optimal slice gap preventing cross-talk between adjacent slices.",
            "Multi-echo acquisition with later echoes showing increased T2 weighting.",
            "Radial streak artifacts from high-contrast structures outside FOV.",
            "Parallel imaging with SENSE reconstruction showing minimal noise enhancement.",
            "Magnetic susceptibility variations creating geometric distortion near rectal air.",
            "Optimal receiver gain providing maximum dynamic range without signal clipping.",
            "Motion-compensated diffusion weighting reducing motion artifacts in T2 images.",
            "Chemical shift artifact displacing fat and water by several pixels.",
            "Variable bandwidth in readout direction optimizing chemical shift and SNR trade-off.",
            "Radial sampling with golden-angle spacing providing motion robustness.",
            "Parallel transmission compensating for B1 inhomogeneity at high field strengths.",
            "Optimal specific absorption rate management without compromising image quality.",
            "Motion artifacts from patient movement degrading capsular definition.",
            "Multi-shot acquisition reducing distortions but sensitive to motion between shots.",
            "Susceptibility-induced signal loss near tissue-air interfaces.",
            "Optimal shim providing excellent magnetic field homogeneity over prostate.",
            "Parallel imaging with high acceleration factor causing noise-like artifacts.",
            "Flow artifacts from iliac vessels creating ghosts across the prostate.",
            "Variable refocusing flip angles maintaining signal throughout long echo trains.",
            "Chemical shift of the first kind creating bright and dark bands at fat-water interfaces.",
            "Motion-insensitive single-shot acquisition with reduced spatial resolution.",
            "Optimal coil positioning providing uniform sensitivity across entire prostate.",
            "Dielectric resonance effects causing localized signal variation at 3T.",
            "Partial volume averaging at capsule interface reducing boundary definition."
        ]
    }
}